hansfbaier/mecrisp-stellaris-atsame70/common/svd2forth-v3/ATSAME70N19.svd-cleaned.svd.uf.svd
      </registers>
    </peripheral>
    <peripheral><name>AFEC1</name><baseAddress>0x40064000</baseAddress><description>Analog Front-End Controller</description><addressBlock>
        <offset>0</offset>
        <size>0xEC</size>
        <usage>registers</usage>
      </addressBlock><interrupt>
        <name>AFEC1</name>
        <value>40</value>
      </interrupt><registers>
        <register>
          <name>CR</name>
          <description>AFEC Control Register</description>
          <addressOffset>0x00</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Software Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>START</name>
              <description>Start Conversion</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MR</name>
          <description>AFEC Mode Register</description>
          <addressOffset>0x04</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TRGEN</name>
              <description>Trigger Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>TRGENSelect</name>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Hardware triggers are disabled. Starting a conversion is only possible by software.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Hardware trigger selected by TRGSEL field is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRGSEL</name>
              <description>Trigger Selection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>TRGSELSelect</name>
                <enumeratedValue>
                  <name>AFEC_TRIG0</name>
                  <description>AFE0_ADTRG for AFEC0 / AFE1_ADTRG for AFEC1</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AFEC_TRIG1</name>
                  <description>TIOA Output of the Timer Counter Channel 0 for AFEC0/TIOA Output of the Timer Counter Channel 3 for AFEC1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AFEC_TRIG2</name>
                  <description>TIOA Output of the Timer Counter Channel 1 for AFEC0/TIOA Output of the Timer Counter Channel 4 for AFEC1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AFEC_TRIG3</name>
                  <description>TIOA Output of the Timer Counter Channel 2 for AFEC0/TIOA Output of the Timer Counter Channel 5 for AFEC1</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AFEC_TRIG4</name>
                  <description>PWM0 event line 0 for AFEC0 / PWM1 event line 0 for AFEC1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AFEC_TRIG5</name>
                  <description>PWM0 event line 1 for AFEC0 / PWM1 event line 1 for AFEC1</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AFEC_TRIG6</name>
                  <description>Analog Comparator</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLEEP</name>
              <description>Sleep Mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>SLEEPSelect</name>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Normal mode: The AFE and reference voltage circuitry are kept ON between conversions.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLEEP</name>
                  <description>Sleep mode: The AFE and reference voltage circuitry are OFF between conversions.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FWUP</name>
              <description>Fast Wake-up</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>FWUPSelect</name>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Normal Sleep mode: The sleep mode is defined by the SLEEP bit.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Fast wake-up Sleep mode: The voltage reference is ON between conversions and AFE is OFF.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FREERUN</name>
              <description>Free Run Mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>FREERUNSelect</name>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Normal mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Free Run mode: Never wait for any trigger.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRESCAL</name>
              <description>Prescaler Rate Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>STARTUP</name>
              <description>Start-up Time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>STARTUPSelect</name>
                <enumeratedValue>
                  <name>SUT0</name>
                  <description>0 periods of AFE clock</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUT8</name>
                  <description>8 periods of AFE clock</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUT16</name>
                  <description>16 periods of AFE clock</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUT24</name>
                  <description>24 periods of AFE clock</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUT64</name>
                  <description>64 periods of AFE clock</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUT80</name>
                  <description>80 periods of AFE clock</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUT96</name>
                  <description>96 periods of AFE clock</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUT112</name>
                  <description>112 periods of AFE clock</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUT512</name>
                  <description>512 periods of AFE clock</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUT576</name>
                  <description>576 periods of AFE clock</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUT640</name>
                  <description>640 periods of AFE clock</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUT704</name>
                  <description>704 periods of AFE clock</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUT768</name>
                  <description>768 periods of AFE clock</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUT832</name>
                  <description>832 periods of AFE clock</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUT896</name>
                  <description>896 periods of AFE clock</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUT960</name>
                  <description>960 periods of AFE clock</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ONE</name>
              <description>One</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRACKTIM</name>
              <description>Tracking Time</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TRANSFER</name>
              <description>Transfer Period</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>USEQ</name>
              <description>User Sequence Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>USEQSelect</name>
                <enumeratedValue>
                  <name>NUM_ORDER</name>
                  <description>Normal mode: The controller converts channels in a simple numeric order.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REG_ORDER</name>
                  <description>User Sequence mode: The sequence respects what is defined in AFEC_SEQ1R and AFEC_SEQ1R.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EMR</name>
          <description>AFEC Extended Mode Register</description>
          <addressOffset>0x08</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CMPMODE</name>
              <description>Comparison Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>CMPMODESelect</name>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Generates an event when the converted data is lower than the low threshold of the window.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>Generates an event when the converted data is higher than the high threshold of the window.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN</name>
                  <description>Generates an event when the converted data is in the comparison window.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUT</name>
                  <description>Generates an event when the converted data is out of the comparison window.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMPSEL</name>
              <description>Comparison Selected Channel</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>CMPALL</name>
              <description>Compare All Channels</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMPFILTER</name>
              <description>Compare Event Filtering</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RES</name>
              <description>Resolution</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>RESSelect</name>
                <enumeratedValue>
                  <name>NO_AVERAGE</name>
                  <description>12-bit resolution, AFE sample rate is maximum no averaging.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR4</name>
                  <description>13-bit resolution, AFE sample rate divided by 4 averaging.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR16</name>
                  <description>14-bit resolution, AFE sample rate divided by 16 averaging.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR64</name>
                  <description>15-bit resolution, AFE sample rate divided by 64 averaging.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSR256</name>
                  <description>16-bit resolution, AFE sample rate divided by 256 averaging.</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TAG</name>
              <description>TAG of the AFEC_LDCR</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STM</name>
              <description>Single Trigger Mode</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SIGNMODE</name>
              <description>Sign Mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>SIGNMODESelect</name>
                <enumeratedValue>
                  <name>SE_UNSG_DF_SIGN</name>
                  <description>Single-Ended channels: Unsigned conversions.Differential channels: Signed conversions.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SE_SIGN_DF_UNSG</name>
                  <description>Single-Ended channels: Signed conversions.Differential channels: Unsigned conversions.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALL_UNSIGNED</name>
                  <description>All channels: Unsigned conversions.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALL_SIGNED</name>
                  <description>All channels: Signed conversions.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SEQ1R</name>
          <description>AFEC Channel Sequence 1 Register</description>
          <addressOffset>0x0C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USCH0</name>
              <description>User Sequence Number 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>USCH1</name>
              <description>User Sequence Number 1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>USCH2</name>
              <description>User Sequence Number 2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>USCH3</name>
              <description>User Sequence Number 3</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>USCH4</name>
              <description>User Sequence Number 4</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>USCH5</name>
              <description>User Sequence Number 5</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>USCH6</name>
              <description>User Sequence Number 6</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>USCH7</name>
              <description>User Sequence Number 7</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SEQ2R</name>
          <description>AFEC Channel Sequence 2 Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USCH8</name>
              <description>User Sequence Number 8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>USCH9</name>
              <description>User Sequence Number 9</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>USCH10</name>
              <description>User Sequence Number 10</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>USCH11</name>
              <description>User Sequence Number 11</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CHER</name>
          <description>AFEC Channel Enable Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CH0</name>
              <description>Channel 0 Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1</name>
              <description>Channel 1 Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH2</name>
              <description>Channel 2 Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH3</name>
              <description>Channel 3 Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH4</name>
              <description>Channel 4 Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH5</name>
              <description>Channel 5 Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH6</name>
              <description>Channel 6 Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH7</name>
              <description>Channel 7 Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH8</name>
              <description>Channel 8 Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH9</name>
              <description>Channel 9 Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH10</name>
              <description>Channel 10 Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH11</name>
              <description>Channel 11 Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
