hansfbaier/mecrisp-stellaris-atsame70/common/svd2forth-v3/ATSAME70N19.svd-cleaned.svd.uf.svd
        <register>
          <name>WPSR</name>
          <description>Write Protection Status Register</description>
          <addressOffset>0xE8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>WPVS</name>
              <description>Write Protection Violation Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WPVSRC</name>
              <description>Write Protection Violation Source</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>EFC</name>
      <version>6450X</version>
      <description>Embedded Flash Controller</description>
      <groupName>EFC</groupName>
      <prependToName>EFC_</prependToName>
      <baseAddress>0x400E0C00</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xE8</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>EFC</name>
        <value>6</value>
      </interrupt>
      <registers>
        <register>
          <name>EEFC_FMR</name>
          <description>EEFC Flash Mode Register</description>
          <addressOffset>0x00</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FRDY</name>
              <description>Flash Ready Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FWS</name>
              <description>Flash Wait State</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SCOD</name>
              <description>Sequential Code Optimization Disable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLOE</name>
              <description>Code Loop Optimization Enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EEFC_FCR</name>
          <description>EEFC Flash Command Register</description>
          <addressOffset>0x04</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>FCMD</name>
              <description>Flash Command</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                <name>FCMDSelect</name>
                <enumeratedValue>
                  <name>GETD</name>
                  <description>Get Flash descriptor</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WP</name>
                  <description>Write page</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WPL</name>
                  <description>Write page and lock</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EWP</name>
                  <description>Erase page and write page</description>
                  <value>0x03</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EWPL</name>
                  <description>Erase page and write page then lock</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EA</name>
                  <description>Erase all</description>
                  <value>0x05</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPA</name>
                  <description>Erase pages</description>
                  <value>0x07</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLB</name>
                  <description>Set lock bit</description>
                  <value>0x08</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLB</name>
                  <description>Clear lock bit</description>
                  <value>0x09</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLB</name>
                  <description>Get lock bit</description>
                  <value>0x0A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SGPB</name>
                  <description>Set GPNVM bit</description>
                  <value>0x0B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CGPB</name>
                  <description>Clear GPNVM bit</description>
                  <value>0x0C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GGPB</name>
                  <description>Get GPNVM bit</description>
                  <value>0x0D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STUI</name>
                  <description>Start read unique identifier</description>
                  <value>0x0E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPUI</name>
                  <description>Stop read unique identifier</description>
                  <value>0x0F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCALB</name>
                  <description>Get CALIB bit</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ES</name>
                  <description>Erase sector</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WUS</name>
                  <description>Write user signature</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EUS</name>
                  <description>Erase user signature</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STUS</name>
                  <description>Start read user signature</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPUS</name>
                  <description>Stop read user signature</description>
                  <value>0x15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FARG</name>
              <description>Flash Command Argument</description>
              <bitOffset>8</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>FKEY</name>
              <description>Flash Writing Protection Key</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                <name>FKEYSelect</name>
                <enumeratedValue>
                  <name>PASSWD</name>
                  <description>The 0x5A value enables the command defined by the bits of the register. If the field is written with a different value, the write is not performed and no action is started.</description>
                  <value>0x5A</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EEFC_FSR</name>
          <description>EEFC Flash Status Register</description>
          <addressOffset>0x08</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>FRDY</name>
              <description>Flash Ready Status cleared when Flash is busy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FCMDE</name>
              <description>Flash Command Error Status cleared on read or by writing EEFC_FCR</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLOCKE</name>
              <description>Flash Lock Error Status cleared on read</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLERR</name>
              <description>Flash Error Status cleared when a programming operation starts</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UECCELSB</name>
              <description>Unique ECC Error on LSB Part of the Memory Flash Data Bus cleared on read</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MECCELSB</name>
              <description>Multiple ECC Error on LSB Part of the Memory Flash Data Bus cleared on read</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UECCEMSB</name>
              <description>Unique ECC Error on MSB Part of the Memory Flash Data Bus cleared on read</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MECCEMSB</name>
              <description>Multiple ECC Error on MSB Part of the Memory Flash Data Bus cleared on read</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EEFC_FRR</name>
          <description>EEFC Flash Result Register</description>
          <addressOffset>0x0C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>FVALUE</name>
              <description>Flash Result Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EEFC_WPMR</name>
          <description>Write Protection Mode Register</description>
          <addressOffset>0xE4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WPEN</name>
              <description>Write Protection Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WPKEY</name>
              <description>Write Protection Key</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <enumeratedValues>
                <name>WPKEYSelect</name>
                <enumeratedValue>
                  <name>PASSWD</name>
                  <description>Writing any other value in this field aborts the write operation.Always reads as 0.</description>
                  <value>0x454643</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
