hansfbaier/mecrisp-stellaris-atsame70/common/svd2forth-v3/ATSAME70N19.svd-cleaned.svd.uf.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GMAC</name>
      <version>11046N</version>
      <description>Gigabit Ethernet MAC</description>
      <groupName>GMAC</groupName>
      <prependToName>GMAC_</prependToName>
      <baseAddress>0x40050000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x7C0</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GMAC</name>
        <value>39</value>
      </interrupt>
      <interrupt>
        <name>GMAC_Q1</name>
        <value>66</value>
      </interrupt>
      <interrupt>
        <name>GMAC_Q2</name>
        <value>67</value>
      </interrupt>
      <registers>
        <register>
          <name>NCR</name>
          <description>Network Control Register</description>
          <addressOffset>0x000</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LBL</name>
              <description>Loop Back Local</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXEN</name>
              <description>Receive Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXEN</name>
              <description>Transmit Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MPE</name>
              <description>Management Port Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLRSTAT</name>
              <description>Clear Statistics Registers</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INCSTAT</name>
              <description>Increment Statistics Registers</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WESTAT</name>
              <description>Write Enable for Statistics Registers</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BP</name>
              <description>Back pressure</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSTART</name>
              <description>Start Transmission</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>THALT</name>
              <description>Transmit Halt</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXPF</name>
              <description>Transmit Pause Frame</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXZQPF</name>
              <description>Transmit Zero Quantum Pause Frame</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRTSM</name>
              <description>Store Receive Time Stamp to Memory</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENPBPR</name>
              <description>Enable PFC Priority-based Pause Reception</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXPBPF</name>
              <description>Transmit PFC Priority-based Pause Frame</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FNP</name>
              <description>Flush Next Packet</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>NCFGR</name>
          <description>Network Configuration Register</description>
          <addressOffset>0x004</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPD</name>
              <description>Speed</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FD</name>
              <description>Full Duplex</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DNVLAN</name>
              <description>Discard Non-VLAN FRAMES</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JFRAME</name>
              <description>Jumbo Frame Size</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAF</name>
              <description>Copy All Frames</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NBC</name>
              <description>No Broadcast</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MTIHEN</name>
              <description>Multicast Hash Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UNIHEN</name>
              <description>Unicast Hash Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MAXFS</name>
              <description>1536 Maximum Frame Size</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTY</name>
              <description>Retry Test</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEN</name>
              <description>Pause Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXBUFO</name>
              <description>Receive Buffer Offset</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>LFERD</name>
              <description>Length Field Error Frame Discard</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RFCS</name>
              <description>Remove FCS</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLK</name>
              <description>MDC CLock Division</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>CLKSelect</name>
                <enumeratedValue>
                  <name>MCK_8</name>
                  <description>MCK divided by 8 MCK up to 20 MHz</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_16</name>
                  <description>MCK divided by 16 MCK up to 40 MHz</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_32</name>
                  <description>MCK divided by 32 MCK up to 80 MHz</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_48</name>
                  <description>MCK divided by 48 MCK up to 120 MHz</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_64</name>
                  <description>MCK divided by 64 MCK up to 160 MHz</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK_96</name>
                  <description>MCK divided by 96 MCK up to 240 MHz</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBW</name>
              <description>Data Bus Width</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DCPF</name>
              <description>Disable Copy of Pause Frames</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXCOEN</name>
              <description>Receive Checksum Offload Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EFRHD</name>
              <description>Enable Frames Received in Half Duplex</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRXFCS</name>
              <description>Ignore RX FCS</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IPGSEN</name>
              <description>IP Stretch Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXBP</name>
              <description>Receive Bad Preamble</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRXER</name>
              <description>Ignore IPG GRXER</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>NSR</name>
          <description>Network Status Register</description>
          <addressOffset>0x008</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>MDIO</name>
              <description>MDIO Input Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IDLE</name>
              <description>PHY Management Logic Idle</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>UR</name>
          <description>User Register</description>
          <addressOffset>0x00C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RMII</name>
              <description>Reduced MII Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DCFGR</name>
          <description>DMA Configuration Register</description>
          <addressOffset>0x010</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FBLDO</name>
              <description>Fixed Burst Length for DMA Data Operations:</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <enumeratedValues>
                <name>FBLDOSelect</name>
                <enumeratedValue>
                  <name>SINGLE</name>
                  <description>00001: Always use SINGLE AHB bursts</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR4</name>
                  <description>001xx: Attempt to use INCR4 AHB bursts Default</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR8</name>
                  <description>01xxx: Attempt to use INCR8 AHB bursts</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR16</name>
                  <description>1xxxx: Attempt to use INCR16 AHB bursts</description>
                  <value>0x10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ESMA</name>
              <description>Endian Swap Mode Enable for Management Descriptor Accesses</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ESPA</name>
              <description>Endian Swap Mode Enable for Packet Data Accesses</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXBMS</name>
              <description>Receiver Packet Buffer Memory Size Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>RXBMSSelect</name>
                <enumeratedValue>
                  <name>EIGHTH</name>
                  <description>4/8 Kbyte Memory Size</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUARTER</name>
                  <description>4/4 Kbytes Memory Size</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALF</name>
                  <description>4/2 Kbytes Memory Size</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FULL</name>
                  <description>4 Kbytes Memory Size</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXPBMS</name>
              <description>Transmitter Packet Buffer Memory Size Select</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXCOEN</name>
              <description>Transmitter Checksum Generation Offload Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DRBS</name>
              <description>DMA Receive Buffer Size</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DDRP</name>
              <description>DMA Discard Receive Packets</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TSR</name>
          <description>Transmit Status Register</description>
          <addressOffset>0x014</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>UBR</name>
              <description>Used Bit Read</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COL</name>
              <description>Collision Occurred</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLE</name>
              <description>Retry Limit Exceeded</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXGO</name>
              <description>Transmit Go</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TFC</name>
              <description>Transmit Frame Corruption Due to AHB Error</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXCOMP</name>
              <description>Transmit Complete</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HRESP</name>
              <description>HRESP Not OK</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RBQB</name>
          <description>Receive Buffer Queue Base Address Register</description>
          <addressOffset>0x018</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Receive Buffer Queue Base Address</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TBQB</name>
          <description>Transmit Buffer Queue Base Address Register</description>
          <addressOffset>0x01C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Transmit Buffer Queue Base Address</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RSR</name>
          <description>Receive Status Register</description>
          <addressOffset>0x020</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BNA</name>
              <description>Buffer Not Available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>REC</name>
              <description>Frame Received</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXOVR</name>
              <description>Receive Overrun</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HNO</name>
              <description>HRESP Not OK</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
