hansfbaier/mecrisp-stellaris-atsame70/common/svd2forth-v3/ATSAME70N19.svd-cleaned.svd.uf.svd
        <register>
          <name>LC</name>
          <description>Late Collisions Register</description>
          <addressOffset>0x144</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>LCOL</name>
              <description>Late Collisions</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DTF</name>
          <description>Deferred Transmission Frames Register</description>
          <addressOffset>0x148</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>DEFT</name>
              <description>Deferred Transmission</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CSE</name>
          <description>Carrier Sense Errors Register</description>
          <addressOffset>0x14C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>CSR</name>
              <description>Carrier Sense Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ORLO</name>
          <description>Octets Received Low Received Register</description>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RXO</name>
              <description>Received Octets</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ORHI</name>
          <description>Octets Received High Received Register</description>
          <addressOffset>0x154</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RXO</name>
              <description>Received Octets</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FR</name>
          <description>Frames Received Register</description>
          <addressOffset>0x158</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>FRX</name>
              <description>Frames Received without Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BCFR</name>
          <description>Broadcast Frames Received Register</description>
          <addressOffset>0x15C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BFRX</name>
              <description>Broadcast Frames Received without Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MFR</name>
          <description>Multicast Frames Received Register</description>
          <addressOffset>0x160</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>MFRX</name>
              <description>Multicast Frames Received without Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PFR</name>
          <description>Pause Frames Received Register</description>
          <addressOffset>0x164</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>PFRX</name>
              <description>Pause Frames Received Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BFR64</name>
          <description>64 Byte Frames Received Register</description>
          <addressOffset>0x168</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>NFRX</name>
              <description>64 Byte Frames Received without Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TBFR127</name>
          <description>65 to 127 Byte Frames Received Register</description>
          <addressOffset>0x16C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>NFRX</name>
              <description>65 to 127 Byte Frames Received without Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TBFR255</name>
          <description>128 to 255 Byte Frames Received Register</description>
          <addressOffset>0x170</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>NFRX</name>
              <description>128 to 255 Byte Frames Received without Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TBFR511</name>
          <description>256 to 511 Byte Frames Received Register</description>
          <addressOffset>0x174</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>NFRX</name>
              <description>256 to 511 Byte Frames Received without Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TBFR1023</name>
          <description>512 to 1023 Byte Frames Received Register</description>
          <addressOffset>0x178</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>NFRX</name>
              <description>512 to 1023 Byte Frames Received without Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TBFR1518</name>
          <description>1024 to 1518 Byte Frames Received Register</description>
          <addressOffset>0x17C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>NFRX</name>
              <description>1024 to 1518 Byte Frames Received without Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TMXBFR</name>
          <description>1519 to Maximum Byte Frames Received Register</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>NFRX</name>
              <description>1519 to Maximum Byte Frames Received without Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>UFR</name>
          <description>Undersize Frames Received Register</description>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>UFRX</name>
              <description>Undersize Frames Received</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OFR</name>
          <description>Oversize Frames Received Register</description>
          <addressOffset>0x188</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>OFRX</name>
              <description>Oversized Frames Received</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>JR</name>
          <description>Jabbers Received Register</description>
          <addressOffset>0x18C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>JRX</name>
              <description>Jabbers Received</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FCSE</name>
          <description>Frame Check Sequence Errors Register</description>
          <addressOffset>0x190</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>FCKR</name>
              <description>Frame Check Sequence Errors</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LFFE</name>
          <description>Length Field Frame Errors Register</description>
          <addressOffset>0x194</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>LFER</name>
              <description>Length Field Frame Errors</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RSE</name>
          <description>Receive Symbol Errors Register</description>
          <addressOffset>0x198</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RXSE</name>
              <description>Receive Symbol Errors</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AE</name>
          <description>Alignment Errors Register</description>
          <addressOffset>0x19C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>AER</name>
              <description>Alignment Errors</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RRE</name>
          <description>Receive Resource Errors Register</description>
          <addressOffset>0x1A0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RXRER</name>
              <description>Receive Resource Errors</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ROE</name>
          <description>Receive Overrun Register</description>
          <addressOffset>0x1A4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RXOVR</name>
              <description>Receive Overruns</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IHCE</name>
          <description>IP Header Checksum Errors Register</description>
          <addressOffset>0x1A8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>HCKER</name>
              <description>IP Header Checksum Errors</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TCE</name>
          <description>TCP Checksum Errors Register</description>
          <addressOffset>0x1AC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>TCKER</name>
              <description>TCP Checksum Errors</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>UCE</name>
          <description>UDP Checksum Errors Register</description>
          <addressOffset>0x1B0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>UCKER</name>
              <description>UDP Checksum Errors</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TISUBN</name>
          <description>1588 Timer Increment Sub-nanoseconds Register</description>
          <addressOffset>0x1BC</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LSBTIR</name>
              <description>Lower Significant Bits of Timer Increment Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TSH</name>
          <description>1588 Timer Seconds High Register</description>
          <addressOffset>0x1C0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TCS</name>
              <description>Timer Count in Seconds</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TSL</name>
          <description>1588 Timer Seconds Low Register</description>
          <addressOffset>0x1D0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TCS</name>
              <description>Timer Count in Seconds</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TN</name>
          <description>1588 Timer Nanoseconds Register</description>
          <addressOffset>0x1D4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TNS</name>
              <description>Timer Count in Nanoseconds</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TA</name>
          <description>1588 Timer Adjust Register</description>
          <addressOffset>0x1D8</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>ITDT</name>
              <description>Increment/Decrement</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
            </field>
            <field>
              <name>ADJ</name>
              <description>Adjust 1588 Timer</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TI</name>
          <description>1588 Timer Increment Register</description>
          <addressOffset>0x1DC</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CNS</name>
              <description>Count Nanoseconds</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>ACNS</name>
              <description>Alternative Count Nanoseconds</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>NIT</name>
              <description>Number of Increments</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EFTSL</name>
          <description>PTP Event Frame Transmitted Seconds Low Register</description>
          <addressOffset>0x1E0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RUD</name>
              <description>Register Update</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EFTN</name>
          <description>PTP Event Frame Transmitted Nanoseconds Register</description>
          <addressOffset>0x1E4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RUD</name>
              <description>Register Update</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EFRSL</name>
          <description>PTP Event Frame Received Seconds Low Register</description>
          <addressOffset>0x1E8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RUD</name>
              <description>Register Update</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EFRN</name>
          <description>PTP Event Frame Received Nanoseconds Register</description>
          <addressOffset>0x1EC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RUD</name>
              <description>Register Update</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PEFTSL</name>
          <description>PTP Peer Event Frame Transmitted Seconds Low Register</description>
          <addressOffset>0x1F0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RUD</name>
              <description>Register Update</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PEFTN</name>
          <description>PTP Peer Event Frame Transmitted Nanoseconds Register</description>
          <addressOffset>0x1F4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RUD</name>
              <description>Register Update</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PEFRSL</name>
          <description>PTP Peer Event Frame Received Seconds Low Register</description>
          <addressOffset>0x1F8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RUD</name>
              <description>Register Update</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PEFRN</name>
          <description>PTP Peer Event Frame Received Nanoseconds Register</description>
          <addressOffset>0x1FC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RUD</name>
              <description>Register Update</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>4</dimIncrement>
          <name>ISRPQ[%s]</name>
          <description>Interrupt Status Register Priority Queue index = 1 0</description>
          <addressOffset>0x3FC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RCOMP</name>
              <description>Receive Complete</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXUBR</name>
              <description>RX Used Bit Read</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLEX</name>
              <description>Retry Limit Exceeded or Late Collision</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TFC</name>
              <description>Transmit Frame Corruption Due to AHB Error</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCOMP</name>
              <description>Transmit Complete</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ROVR</name>
              <description>Receive Overrun</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HRESP</name>
              <description>HRESP Not OK</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
