hansfbaier/mecrisp-stellaris-atsame70/common/svd2forth-v3/ATSAME70N19.svd-cleaned.svd.uf.svd
        <register>
          <name>NDAT2</name>
          <description>New Data 2 Register</description>
          <addressOffset>0x9C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ND32</name>
              <description>New Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ND33</name>
              <description>New Data</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ND34</name>
              <description>New Data</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ND35</name>
              <description>New Data</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ND36</name>
              <description>New Data</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ND37</name>
              <description>New Data</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ND38</name>
              <description>New Data</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ND39</name>
              <description>New Data</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ND40</name>
              <description>New Data</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ND41</name>
              <description>New Data</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ND42</name>
              <description>New Data</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ND43</name>
              <description>New Data</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ND44</name>
              <description>New Data</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ND45</name>
              <description>New Data</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ND46</name>
              <description>New Data</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ND47</name>
              <description>New Data</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ND48</name>
              <description>New Data</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ND49</name>
              <description>New Data</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ND50</name>
              <description>New Data</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ND51</name>
              <description>New Data</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ND52</name>
              <description>New Data</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ND53</name>
              <description>New Data</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ND54</name>
              <description>New Data</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ND55</name>
              <description>New Data</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ND56</name>
              <description>New Data</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ND57</name>
              <description>New Data</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ND58</name>
              <description>New Data</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ND59</name>
              <description>New Data</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ND60</name>
              <description>New Data</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ND61</name>
              <description>New Data</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ND62</name>
              <description>New Data</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ND63</name>
              <description>New Data</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RXF0C</name>
          <description>Receive FIFO 0 Configuration Register</description>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>F0SA</name>
              <description>Receive FIFO 0 Start Address</description>
              <bitOffset>2</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
            <field>
              <name>F0S</name>
              <description>Receive FIFO 0 Start Address</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>F0WM</name>
              <description>Receive FIFO 0 Watermark</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>F0OM</name>
              <description>FIFO 0 Operation Mode</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RXF0S</name>
          <description>Receive FIFO 0 Status Register</description>
          <addressOffset>0xA4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>F0FL</name>
              <description>Receive FIFO 0 Fill Level</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>F0GI</name>
              <description>Receive FIFO 0 Get Index</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>F0PI</name>
              <description>Receive FIFO 0 Put Index</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>F0F</name>
              <description>Receive FIFO 0 Fill Level</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RF0L</name>
              <description>Receive FIFO 0 Message Lost</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RXF0A</name>
          <description>Receive FIFO 0 Acknowledge Register</description>
          <addressOffset>0xA8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>F0AI</name>
              <description>Receive FIFO 0 Acknowledge Index</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RXBC</name>
          <description>Receive Rx Buffer Configuration Register</description>
          <addressOffset>0xAC</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RBSA</name>
              <description>Receive Buffer Start Address</description>
              <bitOffset>2</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RXF1C</name>
          <description>Receive FIFO 1 Configuration Register</description>
          <addressOffset>0xB0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>F1SA</name>
              <description>Receive FIFO 1 Start Address</description>
              <bitOffset>2</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
            <field>
              <name>F1S</name>
              <description>Receive FIFO 1 Start Address</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>F1WM</name>
              <description>Receive FIFO 1 Watermark</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>F1OM</name>
              <description>FIFO 1 Operation Mode</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RXF1S</name>
          <description>Receive FIFO 1 Status Register</description>
          <addressOffset>0xB4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>F1FL</name>
              <description>Receive FIFO 1 Fill Level</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>F1GI</name>
              <description>Receive FIFO 1 Get Index</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>F1PI</name>
              <description>Receive FIFO 1 Put Index</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>F1F</name>
              <description>Receive FIFO 1 Fill Level</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RF1L</name>
              <description>Receive FIFO 1 Message Lost</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMS</name>
              <description>Debug Message Status</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>DMSSelect</name>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>Idle state, wait for reception of debug messages, DMA request is cleared.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSG_A</name>
                  <description>Debug message A received.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSG_AB</name>
                  <description>Debug messages A, B received.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSG_ABC</name>
                  <description>Debug messages A, B, C received, DMA request is set.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RXF1A</name>
          <description>Receive FIFO 1 Acknowledge Register</description>
          <addressOffset>0xB8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>F1AI</name>
              <description>Receive FIFO 1 Acknowledge Index</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RXESC</name>
          <description>Receive Buffer / FIFO Element Size Configuration Register</description>
          <addressOffset>0xBC</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>F0DS</name>
              <description>Receive FIFO 0 Data Field Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>F0DSSelect</name>
                <enumeratedValue>
                  <name>_8_BYTE</name>
                  <description>8-byte data field</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_12_BYTE</name>
                  <description>12-byte data field</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16_BYTE</name>
                  <description>16-byte data field</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_20_BYTE</name>
                  <description>20-byte data field</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_24_BYTE</name>
                  <description>24-byte data field</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32_BYTE</name>
                  <description>32-byte data field</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_48_BYTE</name>
                  <description>48-byte data field</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_64_BYTE</name>
                  <description>64-byte data field</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>F1DS</name>
              <description>Receive FIFO 1 Data Field Size</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>F1DSSelect</name>
                <enumeratedValue>
                  <name>_8_BYTE</name>
                  <description>8-byte data field</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_12_BYTE</name>
                  <description>12-byte data field</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16_BYTE</name>
                  <description>16-byte data field</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_20_BYTE</name>
                  <description>20-byte data field</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_24_BYTE</name>
                  <description>24-byte data field</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32_BYTE</name>
                  <description>32-byte data field</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_48_BYTE</name>
                  <description>48-byte data field</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_64_BYTE</name>
                  <description>64-byte data field</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RBDS</name>
              <description>Receive Buffer Data Field Size</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>RBDSSelect</name>
                <enumeratedValue>
                  <name>_8_BYTE</name>
                  <description>8-byte data field</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_12_BYTE</name>
                  <description>12-byte data field</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16_BYTE</name>
                  <description>16-byte data field</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_20_BYTE</name>
                  <description>20-byte data field</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_24_BYTE</name>
                  <description>24-byte data field</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32_BYTE</name>
                  <description>32-byte data field</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_48_BYTE</name>
                  <description>48-byte data field</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_64_BYTE</name>
                  <description>64-byte data field</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TXBC</name>
          <description>Transmit Buffer Configuration Register</description>
          <addressOffset>0xC0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TBSA</name>
              <description>Tx Buffers Start Address</description>
              <bitOffset>2</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
            <field>
              <name>NDTB</name>
              <description>Number of Dedicated Transmit Buffers</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>TFQS</name>
              <description>Transmit FIFO/Queue Size</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>TFQM</name>
              <description>Tx FIFO/Queue Mode</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFQS</name>
          <description>Transmit FIFO/Queue Status Register</description>
          <addressOffset>0xC4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>TFFL</name>
              <description>Tx FIFO Free Level</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>TFGI</name>
              <description>Tx FIFO Get Index</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>TFQPI</name>
              <description>Tx FIFO/Queue Put Index</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>TFQF</name>
              <description>Tx FIFO/Queue Full</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
