hansfbaier/mecrisp-stellaris-atsame70/common/svd2forth-v3/ATSAME70N19.svd-cleaned.svd.uf.svd
        <register>
          <name>TXBCR</name>
          <description>Transmit Buffer Cancellation Request Register</description>
          <addressOffset>0xD4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CR0</name>
              <description>Cancellation Request for Transmit Buffer 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CR1</name>
              <description>Cancellation Request for Transmit Buffer 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CR2</name>
              <description>Cancellation Request for Transmit Buffer 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CR3</name>
              <description>Cancellation Request for Transmit Buffer 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CR4</name>
              <description>Cancellation Request for Transmit Buffer 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CR5</name>
              <description>Cancellation Request for Transmit Buffer 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CR6</name>
              <description>Cancellation Request for Transmit Buffer 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CR7</name>
              <description>Cancellation Request for Transmit Buffer 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CR8</name>
              <description>Cancellation Request for Transmit Buffer 8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CR9</name>
              <description>Cancellation Request for Transmit Buffer 9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CR10</name>
              <description>Cancellation Request for Transmit Buffer 10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CR11</name>
              <description>Cancellation Request for Transmit Buffer 11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CR12</name>
              <description>Cancellation Request for Transmit Buffer 12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CR13</name>
              <description>Cancellation Request for Transmit Buffer 13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CR14</name>
              <description>Cancellation Request for Transmit Buffer 14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CR15</name>
              <description>Cancellation Request for Transmit Buffer 15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CR16</name>
              <description>Cancellation Request for Transmit Buffer 16</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CR17</name>
              <description>Cancellation Request for Transmit Buffer 17</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CR18</name>
              <description>Cancellation Request for Transmit Buffer 18</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CR19</name>
              <description>Cancellation Request for Transmit Buffer 19</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CR20</name>
              <description>Cancellation Request for Transmit Buffer 20</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CR21</name>
              <description>Cancellation Request for Transmit Buffer 21</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CR22</name>
              <description>Cancellation Request for Transmit Buffer 22</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CR23</name>
              <description>Cancellation Request for Transmit Buffer 23</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CR24</name>
              <description>Cancellation Request for Transmit Buffer 24</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CR25</name>
              <description>Cancellation Request for Transmit Buffer 25</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CR26</name>
              <description>Cancellation Request for Transmit Buffer 26</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CR27</name>
              <description>Cancellation Request for Transmit Buffer 27</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CR28</name>
              <description>Cancellation Request for Transmit Buffer 28</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CR29</name>
              <description>Cancellation Request for Transmit Buffer 29</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CR30</name>
              <description>Cancellation Request for Transmit Buffer 30</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CR31</name>
              <description>Cancellation Request for Transmit Buffer 31</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TXBTO</name>
          <description>Transmit Buffer Transmission Occurred Register</description>
          <addressOffset>0xD8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>TO0</name>
              <description>Transmission Occurred for Buffer 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TO1</name>
              <description>Transmission Occurred for Buffer 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TO2</name>
              <description>Transmission Occurred for Buffer 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TO3</name>
              <description>Transmission Occurred for Buffer 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TO4</name>
              <description>Transmission Occurred for Buffer 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TO5</name>
              <description>Transmission Occurred for Buffer 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TO6</name>
              <description>Transmission Occurred for Buffer 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TO7</name>
              <description>Transmission Occurred for Buffer 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TO8</name>
              <description>Transmission Occurred for Buffer 8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TO9</name>
              <description>Transmission Occurred for Buffer 9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TO10</name>
              <description>Transmission Occurred for Buffer 10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TO11</name>
              <description>Transmission Occurred for Buffer 11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TO12</name>
              <description>Transmission Occurred for Buffer 12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TO13</name>
              <description>Transmission Occurred for Buffer 13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TO14</name>
              <description>Transmission Occurred for Buffer 14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TO15</name>
              <description>Transmission Occurred for Buffer 15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TO16</name>
              <description>Transmission Occurred for Buffer 16</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TO17</name>
              <description>Transmission Occurred for Buffer 17</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TO18</name>
              <description>Transmission Occurred for Buffer 18</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TO19</name>
              <description>Transmission Occurred for Buffer 19</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TO20</name>
              <description>Transmission Occurred for Buffer 20</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TO21</name>
              <description>Transmission Occurred for Buffer 21</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TO22</name>
              <description>Transmission Occurred for Buffer 22</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TO23</name>
              <description>Transmission Occurred for Buffer 23</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TO24</name>
              <description>Transmission Occurred for Buffer 24</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TO25</name>
              <description>Transmission Occurred for Buffer 25</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TO26</name>
              <description>Transmission Occurred for Buffer 26</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TO27</name>
              <description>Transmission Occurred for Buffer 27</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TO28</name>
              <description>Transmission Occurred for Buffer 28</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TO29</name>
              <description>Transmission Occurred for Buffer 29</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TO30</name>
              <description>Transmission Occurred for Buffer 30</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TO31</name>
              <description>Transmission Occurred for Buffer 31</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TXBCF</name>
          <description>Transmit Buffer Cancellation Finished Register</description>
          <addressOffset>0xDC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>CF0</name>
              <description>Cancellation Finished for Transmit Buffer 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CF1</name>
              <description>Cancellation Finished for Transmit Buffer 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CF2</name>
              <description>Cancellation Finished for Transmit Buffer 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CF3</name>
              <description>Cancellation Finished for Transmit Buffer 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CF4</name>
              <description>Cancellation Finished for Transmit Buffer 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CF5</name>
              <description>Cancellation Finished for Transmit Buffer 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CF6</name>
              <description>Cancellation Finished for Transmit Buffer 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CF7</name>
              <description>Cancellation Finished for Transmit Buffer 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CF8</name>
              <description>Cancellation Finished for Transmit Buffer 8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CF9</name>
              <description>Cancellation Finished for Transmit Buffer 9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CF10</name>
              <description>Cancellation Finished for Transmit Buffer 10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CF11</name>
              <description>Cancellation Finished for Transmit Buffer 11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CF12</name>
              <description>Cancellation Finished for Transmit Buffer 12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CF13</name>
              <description>Cancellation Finished for Transmit Buffer 13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CF14</name>
              <description>Cancellation Finished for Transmit Buffer 14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CF15</name>
              <description>Cancellation Finished for Transmit Buffer 15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CF16</name>
              <description>Cancellation Finished for Transmit Buffer 16</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CF17</name>
              <description>Cancellation Finished for Transmit Buffer 17</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CF18</name>
              <description>Cancellation Finished for Transmit Buffer 18</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CF19</name>
              <description>Cancellation Finished for Transmit Buffer 19</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CF20</name>
              <description>Cancellation Finished for Transmit Buffer 20</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CF21</name>
              <description>Cancellation Finished for Transmit Buffer 21</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CF22</name>
              <description>Cancellation Finished for Transmit Buffer 22</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CF23</name>
              <description>Cancellation Finished for Transmit Buffer 23</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CF24</name>
              <description>Cancellation Finished for Transmit Buffer 24</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CF25</name>
              <description>Cancellation Finished for Transmit Buffer 25</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CF26</name>
              <description>Cancellation Finished for Transmit Buffer 26</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CF27</name>
              <description>Cancellation Finished for Transmit Buffer 27</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CF28</name>
              <description>Cancellation Finished for Transmit Buffer 28</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CF29</name>
              <description>Cancellation Finished for Transmit Buffer 29</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CF30</name>
              <description>Cancellation Finished for Transmit Buffer 30</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CF31</name>
              <description>Cancellation Finished for Transmit Buffer 31</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
