hansfbaier/mecrisp-stellaris-atsame70/common/svd2forth-v3/ATSAME70N19.svd-cleaned.svd.uf.svd
        <register>
          <name>PCMR</name>
          <description>Parallel Capture Mode Register</description>
          <addressOffset>0x0150</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PCEN</name>
              <description>Parallel Capture Mode Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DSIZE</name>
              <description>Parallel Capture Mode Data Size</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>DSIZESelect</name>
                <enumeratedValue>
                  <name>BYTE</name>
                  <description>The reception data in the PIO_PCRHR is a byte 8-bit</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALFWORD</name>
                  <description>The reception data in the PIO_PCRHR is a half-word 16-bit</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WORD</name>
                  <description>The reception data in the PIO_PCRHR is a word 32-bit</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALWYS</name>
              <description>Parallel Capture Mode Always Sampling</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HALFS</name>
              <description>Parallel Capture Mode Half Sampling</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FRSTS</name>
              <description>Parallel Capture Mode First Sample</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCIER</name>
          <description>Parallel Capture Interrupt Enable Register</description>
          <addressOffset>0x0154</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DRDY</name>
              <description>Parallel Capture Mode Data Ready Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVRE</name>
              <description>Parallel Capture Mode Overrun Error Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENDRX</name>
              <description>End of Reception Transfer Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXBUFF</name>
              <description>Reception Buffer Full Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCIDR</name>
          <description>Parallel Capture Interrupt Disable Register</description>
          <addressOffset>0x0158</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DRDY</name>
              <description>Parallel Capture Mode Data Ready Interrupt Disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVRE</name>
              <description>Parallel Capture Mode Overrun Error Interrupt Disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENDRX</name>
              <description>End of Reception Transfer Interrupt Disable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXBUFF</name>
              <description>Reception Buffer Full Interrupt Disable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCIMR</name>
          <description>Parallel Capture Interrupt Mask Register</description>
          <addressOffset>0x015C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>DRDY</name>
              <description>Parallel Capture Mode Data Ready Interrupt Mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVRE</name>
              <description>Parallel Capture Mode Overrun Error Interrupt Mask</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENDRX</name>
              <description>End of Reception Transfer Interrupt Mask</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXBUFF</name>
              <description>Reception Buffer Full Interrupt Mask</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCISR</name>
          <description>Parallel Capture Interrupt Status Register</description>
          <addressOffset>0x0160</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>DRDY</name>
              <description>Parallel Capture Mode Data Ready</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVRE</name>
              <description>Parallel Capture Mode Overrun Error</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCRHR</name>
          <description>Parallel Capture Reception Holding Register</description>
          <addressOffset>0x0164</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RDATA</name>
              <description>Parallel Capture Mode Reception Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
      </registers></peripheral>
    <peripheral>
      <name>PMC</name>
      <version>44006G</version>
      <description>Power Management Controller</description>
      <groupName>PMC</groupName>
      <prependToName>PMC_</prependToName>
      <baseAddress>0x400E0600</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x148</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PMC</name>
        <value>5</value>
      </interrupt>
      <registers>
        <register>
          <name>SCER</name>
          <description>System Clock Enable Register</description>
          <addressOffset>0x0000</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>USBCLK</name>
              <description>Enable USB FS Clock</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCK0</name>
              <description>Programmable Clock 0 Output Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCK1</name>
              <description>Programmable Clock 1 Output Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCK2</name>
              <description>Programmable Clock 2 Output Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCK3</name>
              <description>Programmable Clock 3 Output Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCK4</name>
              <description>Programmable Clock 4 Output Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCK5</name>
              <description>Programmable Clock 5 Output Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCK6</name>
              <description>Programmable Clock 6 Output Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SCDR</name>
          <description>System Clock Disable Register</description>
          <addressOffset>0x0004</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>USBCLK</name>
              <description>Disable USB FS Clock</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCK0</name>
              <description>Programmable Clock 0 Output Disable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCK1</name>
              <description>Programmable Clock 1 Output Disable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCK2</name>
              <description>Programmable Clock 2 Output Disable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCK3</name>
              <description>Programmable Clock 3 Output Disable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCK4</name>
              <description>Programmable Clock 4 Output Disable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCK5</name>
              <description>Programmable Clock 5 Output Disable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCK6</name>
              <description>Programmable Clock 6 Output Disable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SCSR</name>
          <description>System Clock Status Register</description>
          <addressOffset>0x0008</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>HCLKS</name>
              <description>HCLK Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USBCLK</name>
              <description>USB FS Clock Status</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCK0</name>
              <description>Programmable Clock 0 Output Status</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCK1</name>
              <description>Programmable Clock 1 Output Status</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCK2</name>
              <description>Programmable Clock 2 Output Status</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCK3</name>
              <description>Programmable Clock 3 Output Status</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCK4</name>
              <description>Programmable Clock 4 Output Status</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCK5</name>
              <description>Programmable Clock 5 Output Status</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCK6</name>
              <description>Programmable Clock 6 Output Status</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCER0</name>
          <description>Peripheral Clock Enable Register 0</description>
          <addressOffset>0x0010</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>PID7</name>
              <description>Peripheral Clock 7 Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID8</name>
              <description>Peripheral Clock 8 Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID9</name>
              <description>Peripheral Clock 9 Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID10</name>
              <description>Peripheral Clock 10 Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID11</name>
              <description>Peripheral Clock 11 Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID12</name>
              <description>Peripheral Clock 12 Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID13</name>
              <description>Peripheral Clock 13 Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID14</name>
              <description>Peripheral Clock 14 Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID15</name>
              <description>Peripheral Clock 15 Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID16</name>
              <description>Peripheral Clock 16 Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID17</name>
              <description>Peripheral Clock 17 Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID18</name>
              <description>Peripheral Clock 18 Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID19</name>
              <description>Peripheral Clock 19 Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID20</name>
              <description>Peripheral Clock 20 Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID21</name>
              <description>Peripheral Clock 21 Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID22</name>
              <description>Peripheral Clock 22 Enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID23</name>
              <description>Peripheral Clock 23 Enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID24</name>
              <description>Peripheral Clock 24 Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID25</name>
              <description>Peripheral Clock 25 Enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID26</name>
              <description>Peripheral Clock 26 Enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID27</name>
              <description>Peripheral Clock 27 Enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID28</name>
              <description>Peripheral Clock 28 Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID29</name>
              <description>Peripheral Clock 29 Enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID30</name>
              <description>Peripheral Clock 30 Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID31</name>
              <description>Peripheral Clock 31 Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
