hansfbaier/mecrisp-stellaris-atsame70/common/svd2forth-v3/ATSAME70N19.svd-cleaned.svd.uf.svd
        <register>
          <name>USB</name>
          <description>USB Clock Register</description>
          <addressOffset>0x0038</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USBS</name>
              <description>USB Input Clock Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USBDIV</name>
              <description>Divider for USB_48M</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>4</dimIncrement>
          <name>PCK[%s]</name>
          <description>Programmable Clock Register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CSS</name>
              <description>Programmable Clock Source Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>CSSSelect</name>
                <enumeratedValue>
                  <name>SLOW_CLK</name>
                  <description>SLCK is selected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAIN_CLK</name>
                  <description>MAINCK is selected</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLLA_CLK</name>
                  <description>PLLACK is selected</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPLL_CLK</name>
                  <description>UPLLCKDIV is selected</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCK</name>
                  <description>MCK is selected</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRES</name>
              <description>Programmable Clock Prescaler</description>
              <bitOffset>4</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <description>Interrupt Enable Register</description>
          <addressOffset>0x0060</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>MOSCXTS</name>
              <description>Main Crystal Oscillator Status Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOCKA</name>
              <description>PLLA Lock Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCKRDY</name>
              <description>Master Clock Ready Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOCKU</name>
              <description>UTMI PLL Lock Interrupt Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCKRDY0</name>
              <description>Programmable Clock Ready 0 Interrupt Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCKRDY1</name>
              <description>Programmable Clock Ready 1 Interrupt Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCKRDY2</name>
              <description>Programmable Clock Ready 2 Interrupt Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCKRDY3</name>
              <description>Programmable Clock Ready 3 Interrupt Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCKRDY4</name>
              <description>Programmable Clock Ready 4 Interrupt Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCKRDY5</name>
              <description>Programmable Clock Ready 5 Interrupt Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCKRDY6</name>
              <description>Programmable Clock Ready 6 Interrupt Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MOSCSELS</name>
              <description>Main Clock Source Oscillator Selection Status Interrupt Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MOSCRCS</name>
              <description>Main RC Oscillator Status Interrupt Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CFDEV</name>
              <description>Clock Failure Detector Event Interrupt Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XT32KERR</name>
              <description>32.768 kHz Crystal Oscillator Error Interrupt Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR</name>
          <description>Interrupt Disable Register</description>
          <addressOffset>0x0064</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>MOSCXTS</name>
              <description>Main Crystal Oscillator Status Interrupt Disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOCKA</name>
              <description>PLLA Lock Interrupt Disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCKRDY</name>
              <description>Master Clock Ready Interrupt Disable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOCKU</name>
              <description>UTMI PLL Lock Interrupt Disable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCKRDY0</name>
              <description>Programmable Clock Ready 0 Interrupt Disable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCKRDY1</name>
              <description>Programmable Clock Ready 1 Interrupt Disable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCKRDY2</name>
              <description>Programmable Clock Ready 2 Interrupt Disable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCKRDY3</name>
              <description>Programmable Clock Ready 3 Interrupt Disable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCKRDY4</name>
              <description>Programmable Clock Ready 4 Interrupt Disable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCKRDY5</name>
              <description>Programmable Clock Ready 5 Interrupt Disable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCKRDY6</name>
              <description>Programmable Clock Ready 6 Interrupt Disable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MOSCSELS</name>
              <description>Main Clock Source Oscillator Selection Status Interrupt Disable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MOSCRCS</name>
              <description>Main RC Status Interrupt Disable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CFDEV</name>
              <description>Clock Failure Detector Event Interrupt Disable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XT32KERR</name>
              <description>32.768 kHz Crystal Oscillator Error Interrupt Disable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>Status Register</description>
          <addressOffset>0x0068</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>MOSCXTS</name>
              <description>Main Crystal Oscillator Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOCKA</name>
              <description>PLLA Lock Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCKRDY</name>
              <description>Master Clock Status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOCKU</name>
              <description>UTMI PLL Lock Status</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OSCSELS</name>
              <description>Slow Clock Source Oscillator Selection</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCKRDY0</name>
              <description>Programmable Clock Ready 0 Status</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCKRDY1</name>
              <description>Programmable Clock Ready 1 Status</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCKRDY2</name>
              <description>Programmable Clock Ready 2 Status</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCKRDY3</name>
              <description>Programmable Clock Ready 3 Status</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCKRDY4</name>
              <description>Programmable Clock Ready 4 Status</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCKRDY5</name>
              <description>Programmable Clock Ready 5 Status</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCKRDY6</name>
              <description>Programmable Clock Ready 6 Status</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MOSCSELS</name>
              <description>Main Clock Source Oscillator Selection Status</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MOSCRCS</name>
              <description>Main RC Oscillator Status</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CFDEV</name>
              <description>Clock Failure Detector Event</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CFDS</name>
              <description>Clock Failure Detector Status</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FOS</name>
              <description>Clock Failure Detector Fault Output Status</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XT32KERR</name>
              <description>Slow Crystal Oscillator Error</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IMR</name>
          <description>Interrupt Mask Register</description>
          <addressOffset>0x006C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>MOSCXTS</name>
              <description>Main Crystal Oscillator Status Interrupt Mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOCKA</name>
              <description>PLLA Lock Interrupt Mask</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCKRDY</name>
              <description>Master Clock Ready Interrupt Mask</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOCKU</name>
              <description>UTMI PLL Lock Interrupt Mask</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCKRDY0</name>
              <description>Programmable Clock Ready 0 Interrupt Mask</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCKRDY1</name>
              <description>Programmable Clock Ready 1 Interrupt Mask</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCKRDY2</name>
              <description>Programmable Clock Ready 2 Interrupt Mask</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCKRDY3</name>
              <description>Programmable Clock Ready 3 Interrupt Mask</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCKRDY4</name>
              <description>Programmable Clock Ready 4 Interrupt Mask</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCKRDY5</name>
              <description>Programmable Clock Ready 5 Interrupt Mask</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCKRDY6</name>
              <description>Programmable Clock Ready 6 Interrupt Mask</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MOSCSELS</name>
              <description>Main Clock Source Oscillator Selection Status Interrupt Mask</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MOSCRCS</name>
              <description>Main RC Status Interrupt Mask</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CFDEV</name>
              <description>Clock Failure Detector Event Interrupt Mask</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XT32KERR</name>
              <description>32.768 kHz Crystal Oscillator Error Interrupt Mask</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
