hansfbaier/mecrisp-stellaris-atsame70/common/svd2forth-v3/ATSAME70N19.svd-cleaned.svd.uf.svd
        <register>
          <name>WPCR</name>
          <description>PWM Write Protection Control Register</description>
          <addressOffset>0xE4</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>WPCMD</name>
              <description>Write Protection Command</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>WPCMDSelect</name>
                <enumeratedValue>
                  <name>DISABLE_SW_PROT</name>
                  <description>Disables the software write protection of the register groups of which the bit WPRGx is at '1'.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_SW_PROT</name>
                  <description>Enables the software write protection of the register groups of which the bit WPRGx is at '1'.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_HW_PROT</name>
                  <description>Enables the hardware write protection of the register groups of which the bit WPRGx is at '1'. Only a hardware reset of the PWM controller can disable the hardware write protection. Moreover, to meet security requirements, the PIO lines associated with the PWM can not be configured through the PIO interface.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WPRG0</name>
              <description>Write Protection Register Group 0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WPRG1</name>
              <description>Write Protection Register Group 1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WPRG2</name>
              <description>Write Protection Register Group 2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WPRG3</name>
              <description>Write Protection Register Group 3</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WPRG4</name>
              <description>Write Protection Register Group 4</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WPRG5</name>
              <description>Write Protection Register Group 5</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WPKEY</name>
              <description>Write Protection Key</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <enumeratedValues>
                <name>WPKEYSelect</name>
                <enumeratedValue>
                  <name>PASSWD</name>
                  <description>Writing any other value in this field aborts the write operation of the WPCMD field.Always reads as 0</description>
                  <value>0x50574D</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WPSR</name>
          <description>PWM Write Protection Status Register</description>
          <addressOffset>0xE8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>WPSWS0</name>
              <description>Write Protect SW Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WPSWS1</name>
              <description>Write Protect SW Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WPSWS2</name>
              <description>Write Protect SW Status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WPSWS3</name>
              <description>Write Protect SW Status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WPSWS4</name>
              <description>Write Protect SW Status</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WPSWS5</name>
              <description>Write Protect SW Status</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WPVS</name>
              <description>Write Protect Violation Status</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WPHWS0</name>
              <description>Write Protect HW Status</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WPHWS1</name>
              <description>Write Protect HW Status</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WPHWS2</name>
              <description>Write Protect HW Status</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WPHWS3</name>
              <description>Write Protect HW Status</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WPHWS4</name>
              <description>Write Protect HW Status</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WPHWS5</name>
              <description>Write Protect HW Status</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WPVSRC</name>
              <description>Write Protect Violation Source</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>8</dim>
          <dimIncrement>16</dimIncrement>
          <name>PWM_CMP[%s]</name>
          <description>PWM Comparison 0 Value Register</description>
          <addressOffset>0x130</addressOffset>
          <register>
            <name>CMPV</name>
            <description>PWM Comparison 0 Value Register</description>
            <addressOffset>0x00</addressOffset>
            <size>32</size>
            <fields>
              <field>
                <name>CV</name>
                <description>Comparison x Value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>24</bitWidth>
              </field>
              <field>
                <name>CVM</name>
                <description>Comparison x Value Mode</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>CMPVUPD</name>
            <description>PWM Comparison 0 Value Update Register</description>
            <addressOffset>0x04</addressOffset>
            <size>32</size>
            <access>write-only</access>
            <fields>
              <field>
                <name>CVUPD</name>
                <description>Comparison x Value Update</description>
                <bitOffset>0</bitOffset>
                <bitWidth>24</bitWidth>
              </field>
              <field>
                <name>CVMUPD</name>
                <description>Comparison x Value Mode Update</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>CMPM</name>
            <description>PWM Comparison 0 Mode Register</description>
            <addressOffset>0x08</addressOffset>
            <size>32</size>
            <fields>
              <field>
                <name>CEN</name>
                <description>Comparison x Enable</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>CTR</name>
                <description>Comparison x Trigger</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
              </field>
              <field>
                <name>CPR</name>
                <description>Comparison x Period</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
              </field>
              <field>
                <name>CPRCNT</name>
                <description>Comparison x Period Counter</description>
                <bitOffset>12</bitOffset>
                <bitWidth>4</bitWidth>
              </field>
              <field>
                <name>CUPR</name>
                <description>Comparison x Update Period</description>
                <bitOffset>16</bitOffset>
                <bitWidth>4</bitWidth>
              </field>
              <field>
                <name>CUPRCNT</name>
                <description>Comparison x Update Period Counter</description>
                <bitOffset>20</bitOffset>
                <bitWidth>4</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>CMPMUPD</name>
            <description>PWM Comparison 0 Mode Update Register</description>
            <addressOffset>0x0C</addressOffset>
            <size>32</size>
            <access>write-only</access>
            <fields>
              <field>
                <name>CENUPD</name>
                <description>Comparison x Enable Update</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>CTRUPD</name>
                <description>Comparison x Trigger Update</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
              </field>
              <field>
                <name>CPRUPD</name>
                <description>Comparison x Period Update</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
              </field>
              <field>
                <name>CUPRUPD</name>
                <description>Comparison x Update Period Update</description>
                <bitOffset>16</bitOffset>
                <bitWidth>4</bitWidth>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>4</dim>
          <dimIncrement>32</dimIncrement>
          <name>PWM_CH_NUM[%s]</name>
          <description>PWM Channel Mode Register ch_num = 0</description>
          <addressOffset>0x200</addressOffset>
          <register>
            <name>CMR</name>
            <description>PWM Channel Mode Register ch_num = 0</description>
            <addressOffset>0x00</addressOffset>
            <size>32</size>
            <fields>
              <field>
                <name>CPRE</name>
                <description>Channel Pre-scaler</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <enumeratedValues>
                  <name>CPRESelect</name>
                  <enumeratedValue>
                    <name>MCK</name>
                    <description>Peripheral clock</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MCK_DIV_2</name>
                    <description>Peripheral clock/2</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MCK_DIV_4</name>
                    <description>Peripheral clock/4</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MCK_DIV_8</name>
                    <description>Peripheral clock/8</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MCK_DIV_16</name>
                    <description>Peripheral clock/16</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MCK_DIV_32</name>
                    <description>Peripheral clock/32</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MCK_DIV_64</name>
                    <description>Peripheral clock/64</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MCK_DIV_128</name>
                    <description>Peripheral clock/128</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MCK_DIV_256</name>
                    <description>Peripheral clock/256</description>
                    <value>0x8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MCK_DIV_512</name>
                    <description>Peripheral clock/512</description>
                    <value>0x9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MCK_DIV_1024</name>
                    <description>Peripheral clock/1024</description>
                    <value>0xA</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CLKA</name>
                    <description>Clock A</description>
                    <value>0xB</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CLKB</name>
                    <description>Clock B</description>
                    <value>0xC</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CALG</name>
                <description>Channel Alignment</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>CPOL</name>
                <description>Channel Polarity</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>CES</name>
                <description>Counter Event Selection</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>UPDS</name>
                <description>Update Selection</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>DPOLI</name>
                <description>Disabled Polarity Inverted</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>TCTS</name>
                <description>Timer Counter Trigger Selection</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>DTE</name>
                <description>Dead-Time Generator Enable</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>DTHI</name>
                <description>Dead-Time PWMHx Output Inverted</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>DTLI</name>
                <description>Dead-Time PWMLx Output Inverted</description>
                <bitOffset>18</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>PPM</name>
                <description>Push-Pull Mode</description>
                <bitOffset>19</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>CDTY</name>
            <description>PWM Channel Duty Cycle Register ch_num = 0</description>
            <addressOffset>0x04</addressOffset>
            <size>32</size>
            <fields>
              <field>
                <name>CDTY</name>
                <description>Channel Duty-Cycle</description>
                <bitOffset>0</bitOffset>
                <bitWidth>24</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>CDTYUPD</name>
            <description>PWM Channel Duty Cycle Update Register ch_num = 0</description>
            <addressOffset>0x08</addressOffset>
            <size>32</size>
            <access>write-only</access>
            <fields>
              <field>
                <name>CDTYUPD</name>
                <description>Channel Duty-Cycle Update</description>
                <bitOffset>0</bitOffset>
                <bitWidth>24</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>CPRD</name>
            <description>PWM Channel Period Register ch_num = 0</description>
            <addressOffset>0x0C</addressOffset>
            <size>32</size>
            <fields>
              <field>
                <name>CPRD</name>
                <description>Channel Period</description>
                <bitOffset>0</bitOffset>
                <bitWidth>24</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>CPRDUPD</name>
            <description>PWM Channel Period Update Register ch_num = 0</description>
            <addressOffset>0x10</addressOffset>
            <size>32</size>
            <access>write-only</access>
            <fields>
              <field>
                <name>CPRDUPD</name>
                <description>Channel Period Update</description>
                <bitOffset>0</bitOffset>
                <bitWidth>24</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>CCNT</name>
            <description>PWM Channel Counter Register ch_num = 0</description>
            <addressOffset>0x14</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <fields>
              <field>
                <name>CNT</name>
                <description>Channel Counter Register</description>
                <bitOffset>0</bitOffset>
                <bitWidth>24</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>DT</name>
            <description>PWM Channel Dead Time Register ch_num = 0</description>
            <addressOffset>0x18</addressOffset>
            <size>32</size>
            <fields>
              <field>
                <name>DTH</name>
                <description>Dead-Time Value for PWMHx Output</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
              </field>
              <field>
                <name>DTL</name>
                <description>Dead-Time Value for PWMLx Output</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>DTUPD</name>
            <description>PWM Channel Dead Time Update Register ch_num = 0</description>
            <addressOffset>0x1C</addressOffset>
            <size>32</size>
            <access>write-only</access>
            <fields>
              <field>
                <name>DTHUPD</name>
                <description>Dead-Time Value Update for PWMHx Output</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
              </field>
              <field>
                <name>DTLUPD</name>
                <description>Dead-Time Value Update for PWMLx Output</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>CMUPD0</name>
          <description>PWM Channel Mode Update Register ch_num = 0</description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CPOLUP</name>
              <description>Channel Polarity Update</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPOLINVUP</name>
              <description>Channel Polarity Inversion Update</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CMUPD1</name>
          <description>PWM Channel Mode Update Register ch_num = 1</description>
          <addressOffset>0x420</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CPOLUP</name>
              <description>Channel Polarity Update</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPOLINVUP</name>
              <description>Channel Polarity Inversion Update</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
