hansfbaier/mecrisp-stellaris-atsame70/common/svd2forth-v3/ATSAME70N19.svd-cleaned.svd.uf.svd
        <register>
          <name>IDR</name>
          <description>Interrupt Disable Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>RDRF</name>
              <description>Receive Data Register Full Interrupt Disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TDRE</name>
              <description>Transmit Data Register Empty Interrupt Disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXEMPTY</name>
              <description>Transmission Registers Empty Disable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVRES</name>
              <description>Overrun Error Interrupt Disable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSR</name>
              <description>Chip Select Rise Interrupt Disable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSS</name>
              <description>Chip Select Status Interrupt Disable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INSTRE</name>
              <description>Instruction End Interrupt Disable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IMR</name>
          <description>Interrupt Mask Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RDRF</name>
              <description>Receive Data Register Full Interrupt Mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TDRE</name>
              <description>Transmit Data Register Empty Interrupt Mask</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXEMPTY</name>
              <description>Transmission Registers Empty Mask</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVRES</name>
              <description>Overrun Error Interrupt Mask</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSR</name>
              <description>Chip Select Rise Interrupt Mask</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSS</name>
              <description>Chip Select Status Interrupt Mask</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INSTRE</name>
              <description>Instruction End Interrupt Mask</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SCR</name>
          <description>Serial Clock Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CPOL</name>
              <description>Clock Polarity</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPHA</name>
              <description>Clock Phase</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SCBR</name>
              <description>Serial Clock Baud Rate</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DLYBS</name>
              <description>Delay Before QSCK</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IAR</name>
          <description>Instruction Address Register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <description>Instruction Code Register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INST</name>
              <description>Instruction Code</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>OPT</name>
              <description>Option Code</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IFR</name>
          <description>Instruction Frame Register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WIDTH</name>
              <description>Width of Instruction Code, Address, Option Code and Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>WIDTHSelect</name>
                <enumeratedValue>
                  <name>SINGLE_BIT_SPI</name>
                  <description>Instruction: Single-bit SPI / Address-Option: Single-bit SPI / Data: Single-bit SPI</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DUAL_OUTPUT</name>
                  <description>Instruction: Single-bit SPI / Address-Option: Single-bit SPI / Data: Dual SPI</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_OUTPUT</name>
                  <description>Instruction: Single-bit SPI / Address-Option: Single-bit SPI / Data: Quad SPI</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DUAL_IO</name>
                  <description>Instruction: Single-bit SPI / Address-Option: Dual SPI / Data: Dual SPI</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_IO</name>
                  <description>Instruction: Single-bit SPI / Address-Option: Quad SPI / Data: Quad SPI</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DUAL_CMD</name>
                  <description>Instruction: Dual SPI / Address-Option: Dual SPI / Data: Dual SPI</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_CMD</name>
                  <description>Instruction: Quad SPI / Address-Option: Quad SPI / Data: Quad SPI</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INSTEN</name>
              <description>Instruction Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADDREN</name>
              <description>Address Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPTEN</name>
              <description>Option Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DATAEN</name>
              <description>Data Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPTL</name>
              <description>Option Code Length</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>OPTLSelect</name>
                <enumeratedValue>
                  <name>OPTION_1BIT</name>
                  <description>The option code is 1 bit long.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPTION_2BIT</name>
                  <description>The option code is 2 bits long.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPTION_4BIT</name>
                  <description>The option code is 4 bits long.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPTION_8BIT</name>
                  <description>The option code is 8 bits long.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDRL</name>
              <description>Address Length</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>ADDRLSelect</name>
                <enumeratedValue>
                  <name>_24_BIT</name>
                  <description>The address is 24 bits long.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32_BIT</name>
                  <description>The address is 32 bits long.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TFRTYP</name>
              <description>Data Transfer Type</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>TFRTYPSelect</name>
                <enumeratedValue>
                  <name>TRSFR_READ</name>
                  <description>Read transfer from the serial memory.Scrambling is not performed.Read at random location fetch in the serial Flash memory is not possible.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRSFR_READ_MEMORY</name>
                  <description>Read data transfer from the serial memory.If enabled, scrambling is performed.Read at random location fetch in the serial Flash memory is possible.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRSFR_WRITE</name>
                  <description>Write transfer into the serial memory.Scrambling is not performed.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRSFR_WRITE_MEMORY</name>
                  <description>Write data transfer into the serial memory.If enabled, scrambling is performed.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRM</name>
              <description>Continuous Read Mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CRMSelect</name>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>The Continuous Read mode is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>The Continuous Read mode is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NBDUM</name>
              <description>Number Of Dummy Cycles</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SMR</name>
          <description>Scrambling Mode Register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SCREN</name>
              <description>Scrambling/Unscrambling Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>SCRENSelect</name>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>The scrambling/unscrambling is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>The scrambling/unscrambling is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RVDIS</name>
              <description>Scrambling/Unscrambling Random Value Disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SKR</name>
          <description>Scrambling Key Register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>USRK</name>
              <description>Scrambling User Key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WPMR</name>
          <description>Write Protection Mode Register</description>
          <addressOffset>0xE4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WPEN</name>
              <description>Write Protection Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WPKEY</name>
              <description>Write Protection Key</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <enumeratedValues>
                <name>WPKEYSelect</name>
                <enumeratedValue>
                  <name>PASSWD</name>
                  <description>Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0.</description>
                  <value>0x515350</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WPSR</name>
          <description>Write Protection Status Register</description>
          <addressOffset>0xE8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>WPVS</name>
              <description>Write Protection Violation Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WPVSRC</name>
              <description>Write Protection Violation Source</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
