hansfbaier/mecrisp-stellaris-atsame70/common/svd2forth-v3/ATSAME70N19.svd-cleaned.svd.uf.svd
          <register>
            <name>CMR</name>
            <description>Channel Mode Register channel = 0</description>
            <addressOffset>0x04</addressOffset>
            <size>32</size>
            <fields>
              <field>
                <name>TCCLKS</name>
                <description>Clock Selection</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <enumeratedValues>
                  <name>TCCLKSSelect</name>
                  <enumeratedValue>
                    <name>TIMER_CLOCK1</name>
                    <description>Clock selected: internal PCK6 clock signal from PMC</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIMER_CLOCK2</name>
                    <description>Clock selected: internal MCK/8 clock signal from PMC</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIMER_CLOCK3</name>
                    <description>Clock selected: internal MCK/32 clock signal from PMC</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIMER_CLOCK4</name>
                    <description>Clock selected: internal MCK/128 clock signal from PMC</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIMER_CLOCK5</name>
                    <description>Clock selected: internal SLCK clock signal from PMC</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>XC0</name>
                    <description>Clock selected: XC0</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>XC1</name>
                    <description>Clock selected: XC1</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>XC2</name>
                    <description>Clock selected: XC2</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CLKI</name>
                <description>Clock Invert</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>BURST</name>
                <description>Burst Signal Selection</description>
                <bitOffset>4</bitOffset>
                <bitWidth>2</bitWidth>
                <enumeratedValues>
                  <name>BURSTSelect</name>
                  <enumeratedValue>
                    <name>NONE</name>
                    <description>The clock is not gated by an external signal.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>XC0</name>
                    <description>XC0 is ANDed with the selected clock.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>XC1</name>
                    <description>XC1 is ANDed with the selected clock.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>XC2</name>
                    <description>XC2 is ANDed with the selected clock.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LDBSTOP</name>
                <description>Counter Clock Stopped with RB Loading</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>LDBDIS</name>
                <description>Counter Clock Disable with RB Loading</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>ETRGEDG</name>
                <description>External Trigger Edge Selection</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <enumeratedValues>
                  <name>ETRGEDGSelect</name>
                  <enumeratedValue>
                    <name>NONE</name>
                    <description>The clock is not gated by an external signal.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RISING</name>
                    <description>Rising edge</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FALLING</name>
                    <description>Falling edge</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EDGE</name>
                    <description>Each edge</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ABETRG</name>
                <description>TIOAx or TIOBx External Trigger Selection</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>CPCTRG</name>
                <description>RC Compare Trigger Enable</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>WAVE</name>
                <description>Waveform Mode</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>LDRA</name>
                <description>RA Loading Edge Selection</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <enumeratedValues>
                  <name>LDRASelect</name>
                  <enumeratedValue>
                    <name>NONE</name>
                    <description>None</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RISING</name>
                    <description>Rising edge of TIOAx</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FALLING</name>
                    <description>Falling edge of TIOAx</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EDGE</name>
                    <description>Each edge of TIOAx</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LDRB</name>
                <description>RB Loading Edge Selection</description>
                <bitOffset>18</bitOffset>
                <bitWidth>2</bitWidth>
                <enumeratedValues>
                  <name>LDRBSelect</name>
                  <enumeratedValue>
                    <name>NONE</name>
                    <description>None</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RISING</name>
                    <description>Rising edge of TIOAx</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FALLING</name>
                    <description>Falling edge of TIOAx</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EDGE</name>
                    <description>Each edge of TIOAx</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SBSMPLR</name>
                <description>Loading Edge Subsampling Ratio</description>
                <bitOffset>20</bitOffset>
                <bitWidth>3</bitWidth>
                <enumeratedValues>
                  <name>SBSMPLRSelect</name>
                  <enumeratedValue>
                    <name>ONE</name>
                    <description>Load a Capture Register each selected edge</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HALF</name>
                    <description>Load a Capture Register every 2 selected edges</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FOURTH</name>
                    <description>Load a Capture Register every 4 selected edges</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EIGHTH</name>
                    <description>Load a Capture Register every 8 selected edges</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SIXTEENTH</name>
                    <description>Load a Capture Register every 16 selected edges</description>
                    <value>0x4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SMMR</name>
            <description>Stepper Motor Mode Register channel = 0</description>
            <addressOffset>0x08</addressOffset>
            <size>32</size>
            <fields>
              <field>
                <name>GCEN</name>
                <description>Gray Count Enable</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>DOWN</name>
                <description>Down Count</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>RAB</name>
            <description>Register AB channel = 0</description>
            <addressOffset>0x0C</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <fields>
              <field>
                <name>RAB</name>
                <description>Register A or Register B</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>CV</name>
            <description>Counter Value channel = 0</description>
            <addressOffset>0x10</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <fields>
              <field>
                <name>CV</name>
                <description>Counter Value</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>RA</name>
            <description>Register A channel = 0</description>
            <addressOffset>0x14</addressOffset>
            <size>32</size>
            <fields>
              <field>
                <name>RA</name>
                <description>Register A</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>RB</name>
            <description>Register B channel = 0</description>
            <addressOffset>0x18</addressOffset>
            <size>32</size>
            <fields>
              <field>
                <name>RB</name>
                <description>Register B</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>RC</name>
            <description>Register C channel = 0</description>
            <addressOffset>0x1C</addressOffset>
            <size>32</size>
            <fields>
              <field>
                <name>RC</name>
                <description>Register C</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>SR</name>
            <description>Status Register channel = 0</description>
            <addressOffset>0x20</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <fields>
              <field>
                <name>COVFS</name>
                <description>Counter Overflow Status cleared on read</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>LOVRS</name>
                <description>Load Overrun Status cleared on read</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>CPAS</name>
                <description>RA Compare Status cleared on read</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>CPBS</name>
                <description>RB Compare Status cleared on read</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>CPCS</name>
                <description>RC Compare Status cleared on read</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>LDRAS</name>
                <description>RA Loading Status cleared on read</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>LDRBS</name>
                <description>RB Loading Status cleared on read</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>ETRGS</name>
                <description>External Trigger Status cleared on read</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>CLKSTA</name>
                <description>Clock Enabling Status</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>MTIOA</name>
                <description>TIOAx Mirror</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>MTIOB</name>
                <description>TIOBx Mirror</description>
                <bitOffset>18</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>IER</name>
            <description>Interrupt Enable Register channel = 0</description>
            <addressOffset>0x24</addressOffset>
            <size>32</size>
            <access>write-only</access>
            <fields>
              <field>
                <name>COVFS</name>
                <description>Counter Overflow</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>LOVRS</name>
                <description>Load Overrun</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>CPAS</name>
                <description>RA Compare</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>CPBS</name>
                <description>RB Compare</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>CPCS</name>
                <description>RC Compare</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>LDRAS</name>
                <description>RA Loading</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>LDRBS</name>
                <description>RB Loading</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>ETRGS</name>
                <description>External Trigger</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>IDR</name>
            <description>Interrupt Disable Register channel = 0</description>
            <addressOffset>0x28</addressOffset>
            <size>32</size>
            <access>write-only</access>
            <fields>
              <field>
                <name>COVFS</name>
                <description>Counter Overflow</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>LOVRS</name>
                <description>Load Overrun</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>CPAS</name>
                <description>RA Compare</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>CPBS</name>
                <description>RB Compare</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>CPCS</name>
                <description>RC Compare</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>LDRAS</name>
                <description>RA Loading</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>LDRBS</name>
                <description>RB Loading</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>ETRGS</name>
                <description>External Trigger</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>IMR</name>
            <description>Interrupt Mask Register channel = 0</description>
            <addressOffset>0x2C</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <fields>
              <field>
                <name>COVFS</name>
                <description>Counter Overflow</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>LOVRS</name>
                <description>Load Overrun</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>CPAS</name>
                <description>RA Compare</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>CPBS</name>
                <description>RB Compare</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>CPCS</name>
                <description>RC Compare</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>LDRAS</name>
                <description>RA Loading</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>LDRBS</name>
                <description>RB Loading</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>ETRGS</name>
                <description>External Trigger</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
            </fields>
          </register>
