hansfbaier/mecrisp-stellaris-atsame70/common/svd2forth-v3/ATSAME70N19.svd-cleaned.svd.uf.svd
        <register>
          <name>US_CSR</name>
          <description>Channel Status Register</description>
          <addressOffset>0x0014</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RXRDY</name>
              <description>Receiver Ready cleared by reading US_RHR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXRDY</name>
              <description>Transmitter Ready cleared by writing US_THR</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXBRK</name>
              <description>Break Received/End of Break cleared by writing a one to bit US_CR.RSTSTA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVRE</name>
              <description>Overrun Error cleared by writing a one to bit US_CR.RSTSTA</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FRAME</name>
              <description>Framing Error cleared by writing a one to bit US_CR.RSTSTA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PARE</name>
              <description>Parity Error cleared by writing a one to bit US_CR.RSTSTA</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMEOUT</name>
              <description>Receiver Time-out cleared by writing a one to bit US_CR.STTTO</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXEMPTY</name>
              <description>Transmitter Empty cleared by writing US_THR</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ITER</name>
              <description>Max Number of Repetitions Reached cleared by writing a one to bit US_CR.RSTIT</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NACK</name>
              <description>Non Acknowledge Interrupt cleared by writing a one to bit US_CR.RSTNACK</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RIIC</name>
              <description>Ring Indicator Input Change Flag cleared on read</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DSRIC</name>
              <description>Data Set Ready Input Change Flag cleared on read</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DCDIC</name>
              <description>Data Carrier Detect Input Change Flag cleared on read</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTSIC</name>
              <description>Clear to Send Input Change Flag cleared on read</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RI</name>
              <description>Image of RI Input</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DSR</name>
              <description>Image of DSR Input</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DCD</name>
              <description>Image of DCD Input</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTS</name>
              <description>Image of CTS Input</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MANERR</name>
              <description>Manchester Error cleared by writing a one to the bit US_CR.RSTSTA</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>US_RHR</name>
          <description>Receive Holding Register</description>
          <addressOffset>0x0018</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RXCHR</name>
              <description>Received Character</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>RXSYNH</name>
              <description>Received Sync</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>US_THR</name>
          <description>Transmit Holding Register</description>
          <addressOffset>0x001C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>TXCHR</name>
              <description>Character to be Transmitted</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>TXSYNH</name>
              <description>Sync Field to be Transmitted</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>US_BRGR</name>
          <description>Baud Rate Generator Register</description>
          <addressOffset>0x0020</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CD</name>
              <description>Clock Divider</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>FP</name>
              <description>Fractional Part</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>US_RTOR</name>
          <description>Receiver Time-out Register</description>
          <addressOffset>0x0024</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TO</name>
              <description>Time-out Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>US_TTGR</name>
          <description>Transmitter Timeguard Register</description>
          <addressOffset>0x0028</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TG</name>
              <description>Timeguard Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>US_FIDI</name>
          <description>FI DI Ratio Register</description>
          <addressOffset>0x0040</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FI_DI_RATIO</name>
              <description>FI Over DI Ratio Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>US_NER</name>
          <description>Number of Errors Register</description>
          <addressOffset>0x0044</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>NB_ERRORS</name>
              <description>Number of Errors</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>US_IF</name>
          <description>IrDA Filter Register</description>
          <addressOffset>0x004C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IRDA_FILTER</name>
              <description>IrDA Filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>US_MAN</name>
          <description>Manchester Configuration Register</description>
          <addressOffset>0x0050</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TX_PL</name>
              <description>Transmitter Preamble Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TX_PP</name>
              <description>Transmitter Preamble Pattern</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>TX_PPSelect</name>
                <enumeratedValue>
                  <name>ALL_ONE</name>
                  <description>The preamble is composed of '1's</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALL_ZERO</name>
                  <description>The preamble is composed of '0's</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO_ONE</name>
                  <description>The preamble is composed of '01's</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE_ZERO</name>
                  <description>The preamble is composed of '10's</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX_MPOL</name>
              <description>Transmitter Manchester Polarity</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RX_PL</name>
              <description>Receiver Preamble Length</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RX_PP</name>
              <description>Receiver Preamble Pattern detected</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>RX_PPSelect</name>
                <enumeratedValue>
                  <name>ALL_ONE</name>
                  <description>The preamble is composed of '1's</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALL_ZERO</name>
                  <description>The preamble is composed of '0's</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO_ONE</name>
                  <description>The preamble is composed of '01's</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE_ZERO</name>
                  <description>The preamble is composed of '10's</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_MPOL</name>
              <description>Receiver Manchester Polarity</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ONE</name>
              <description>Must Be Set to 1</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DRIFT</name>
              <description>Drift Compensation</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXIDLEV</name>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>US_LINMR</name>
          <description>LIN Mode Register</description>
          <addressOffset>0x0054</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>NACT</name>
              <description>LIN Node Action</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>NACTSelect</name>
                <enumeratedValue>
                  <name>PUBLISH</name>
                  <description>The USART transmits the response.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUBSCRIBE</name>
                  <description>The USART receives the response.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IGNORE</name>
                  <description>The USART does not transmit and does not receive the response.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PARDIS</name>
              <description>Parity Disable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHKDIS</name>
              <description>Checksum Disable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHKTYP</name>
              <description>Checksum Type</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DLM</name>
              <description>Data Length Mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FSDIS</name>
              <description>Frame Slot Mode Disable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPTYP</name>
              <description>Wakeup Signal Type</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DLC</name>
              <description>Data Length Control</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>PDCM</name>
              <description>DMAC Mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYNCDIS</name>
              <description>Synchronization Disable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>US_LINIR</name>
          <description>LIN Identifier Register</description>
          <addressOffset>0x0058</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IDCHR</name>
              <description>Identifier Character</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>US_LINBRR</name>
          <description>LIN Baud Rate Register</description>
          <addressOffset>0x005C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>LINCD</name>
              <description>Clock Divider after Synchronization</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>LINFP</name>
              <description>Fractional Part after Synchronization</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>US_LONMR</name>
          <description>LON Mode Register</description>
          <addressOffset>0x0060</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COMMT</name>
              <description>LON comm_type Parameter Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COLDET</name>
              <description>LON Collision Detection Feature</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCOL</name>
              <description>Terminate Frame upon Collision Notification</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CDTAIL</name>
              <description>LON Collision Detection on Frame Tail</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMAM</name>
              <description>LON DMA Mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LCDS</name>
              <description>LON Collision Detection Source</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOFS</name>
              <description>End of Frame Condition Size</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>US_LONPR</name>
          <description>LON Preamble Register</description>
          <addressOffset>0x0064</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LONPL</name>
              <description>LON Preamble Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>US_LONDL</name>
          <description>LON Data Length Register</description>
          <addressOffset>0x0068</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LONDL</name>
              <description>LON Data Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>US_LONL2HDR</name>
          <description>LON L2HDR Register</description>
          <addressOffset>0x006C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BLI</name>
              <description>LON Backlog Increment</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>ALTP</name>
              <description>LON Alternate Path Bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PB</name>
              <description>LON Priority Bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>US_LONBL</name>
          <description>LON Backlog Register</description>
          <addressOffset>0x0070</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>LONBL</name>
              <description>LON Node Backlog Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>US_LONB1TX</name>
          <description>LON Beta1 Tx Register</description>
          <addressOffset>0x0074</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BETA1TX</name>
              <description>LON Beta1 Length after Transmission</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>US_LONB1RX</name>
          <description>LON Beta1 Rx Register</description>
          <addressOffset>0x0078</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BETA1RX</name>
              <description>LON Beta1 Length after Reception</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>US_LONPRIO</name>
          <description>LON Priority Register</description>
          <addressOffset>0x007C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PSNB</name>
              <description>LON Priority Slot Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>NPS</name>
              <description>LON Node Priority Slot</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>US_IDTTX</name>
          <description>LON IDT Tx Register</description>
          <addressOffset>0x0080</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IDTTX</name>
              <description>LON Indeterminate Time after Transmission comm_type = 1 mode only</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
