hansfbaier/mecrisp-stellaris-atsame70/common/svd2forth-v3/ATSAME70N19.svd-cleaned.svd.uf.svd
        <register>
          <dim>10</dim>
          <dimIncrement>4</dimIncrement>
          <name>DEVEPTIER[%s]</name>
          <description>Device Endpoint Enable Register n = 0 0</description>
          <addressOffset>0x1F0</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>TXINES</name>
              <description>Transmitted IN Data Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXOUTES</name>
              <description>Received OUT Data Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXSTPES</name>
              <description>Received SETUP Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NAKOUTES</name>
              <description>NAKed OUT Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NAKINES</name>
              <description>NAKed IN Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVERFES</name>
              <description>Overflow Interrupt Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STALLEDES</name>
              <description>STALLed Interrupt Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SHORTPACKETES</name>
              <description>Short Packet Interrupt Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NBUSYBKES</name>
              <description>Number of Busy Banks Interrupt Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>KILLBKS</name>
              <description>Kill IN Bank</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FIFOCONS</name>
              <description>FIFO Control</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EPDISHDMAS</name>
              <description>Endpoint Interrupts Disable HDMA Request Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NYETDISS</name>
              <description>NYET Token Disable Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSTDTS</name>
              <description>Reset Data Toggle Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STALLRQS</name>
              <description>STALL Request Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>10</dim>
          <dimIncrement>4</dimIncrement>
          <name>DEVEPTIDR[%s]</name>
          <description>Device Endpoint Disable Register n = 0 0</description>
          <addressOffset>0x220</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>TXINEC</name>
              <description>Transmitted IN Interrupt Clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXOUTEC</name>
              <description>Received OUT Data Interrupt Clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXSTPEC</name>
              <description>Received SETUP Interrupt Clear</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NAKOUTEC</name>
              <description>NAKed OUT Interrupt Clear</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NAKINEC</name>
              <description>NAKed IN Interrupt Clear</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVERFEC</name>
              <description>Overflow Interrupt Clear</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STALLEDEC</name>
              <description>STALLed Interrupt Clear</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SHORTPACKETEC</name>
              <description>Shortpacket Interrupt Clear</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NBUSYBKEC</name>
              <description>Number of Busy Banks Interrupt Clear</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FIFOCONC</name>
              <description>FIFO Control Clear</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EPDISHDMAC</name>
              <description>Endpoint Interrupts Disable HDMA Request Clear</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NYETDISC</name>
              <description>NYET Token Disable Clear</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STALLRQC</name>
              <description>STALL Request Clear</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>7</dim>
          <dimIncrement>16</dimIncrement>
          <name>USBHS_DEVDMA[%s]</name>
          <description>Device DMA Channel Next Descriptor Address Register n = 1</description>
          <addressOffset>0x310</addressOffset>
          <register>
            <name>DEVDMANXTDSC</name>
            <description>Device DMA Channel Next Descriptor Address Register n = 1</description>
            <addressOffset>0x00</addressOffset>
            <size>32</size>
            <fields>
              <field>
                <name>NXT_DSC_ADD</name>
                <description>Next Descriptor Address</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>DEVDMAADDRESS</name>
            <description>Device DMA Channel Address Register n = 1</description>
            <addressOffset>0x04</addressOffset>
            <size>32</size>
            <fields>
              <field>
                <name>BUFF_ADD</name>
                <description>Buffer Address</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>DEVDMACONTROL</name>
            <description>Device DMA Channel Control Register n = 1</description>
            <addressOffset>0x08</addressOffset>
            <size>32</size>
            <fields>
              <field>
                <name>CHANN_ENB</name>
                <description>Channel Enable Command</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>LDNXT_DSC</name>
                <description>Load Next Channel Transfer Descriptor Enable Command</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>END_TR_EN</name>
                <description>End of Transfer Enable Control OUT transfers only</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>END_B_EN</name>
                <description>End of Buffer Enable Control</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>END_TR_IT</name>
                <description>End of Transfer Interrupt Enable</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>END_BUFFIT</name>
                <description>End of Buffer Interrupt Enable</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>DESC_LD_IT</name>
                <description>Descriptor Loaded Interrupt Enable</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>BURST_LCK</name>
                <description>Burst Lock Enable</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>BUFF_LENGTH</name>
                <description>Buffer Byte Length Write-only</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>DEVDMASTATUS</name>
            <description>Device DMA Channel Status Register n = 1</description>
            <addressOffset>0x0C</addressOffset>
            <size>32</size>
            <fields>
              <field>
                <name>CHANN_ENB</name>
                <description>Channel Enable Status</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>CHANN_ACT</name>
                <description>Channel Active Status</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>END_TR_ST</name>
                <description>End of Channel Transfer Status</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>END_BF_ST</name>
                <description>End of Channel Buffer Status</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>DESC_LDST</name>
                <description>Descriptor Loaded Status</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>BUFF_COUNT</name>
                <description>Buffer Byte Count</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>HSTCTRL</name>
          <description>Host General Control Register</description>
          <addressOffset>0x0400</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SOFE</name>
              <description>Start of Frame Generation Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESET</name>
              <description>Send USB Reset</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESUME</name>
              <description>Send USB Resume</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPDCONF</name>
              <description>Mode Configuration</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>SPDCONFSelect</name>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>The host starts in Full-speed mode and performs a high-speed reset to switch to High-speed mode if the downstream peripheral is high-speed capable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW_POWER</name>
                  <description>For a better consumption, if high speed is not needed.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HSTISR</name>
          <description>Host Global Interrupt Status Register</description>
          <addressOffset>0x0404</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>DCONNI</name>
              <description>Device Connection Interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DDISCI</name>
              <description>Device Disconnection Interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSTI</name>
              <description>USB Reset Sent Interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSMEDI</name>
              <description>Downstream Resume Sent Interrupt</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXRSMI</name>
              <description>Upstream Resume Received Interrupt</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSOFI</name>
              <description>Host Start of Frame Interrupt</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HWUPI</name>
              <description>Host Wake-Up Interrupt</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEP_0</name>
              <description>Pipe 0 Interrupt</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEP_1</name>
              <description>Pipe 1 Interrupt</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEP_2</name>
              <description>Pipe 2 Interrupt</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEP_3</name>
              <description>Pipe 3 Interrupt</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEP_4</name>
              <description>Pipe 4 Interrupt</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEP_5</name>
              <description>Pipe 5 Interrupt</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEP_6</name>
              <description>Pipe 6 Interrupt</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEP_7</name>
              <description>Pipe 7 Interrupt</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEP_8</name>
              <description>Pipe 8 Interrupt</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEP_9</name>
              <description>Pipe 9 Interrupt</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEP_10</name>
              <description>Pipe 10 Interrupt</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEP_11</name>
              <description>Pipe 11 Interrupt</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA_1</name>
              <description>DMA Channel 1 Interrupt</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA_2</name>
              <description>DMA Channel 2 Interrupt</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA_3</name>
              <description>DMA Channel 3 Interrupt</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA_4</name>
              <description>DMA Channel 4 Interrupt</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA_5</name>
              <description>DMA Channel 5 Interrupt</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA_6</name>
              <description>DMA Channel 6 Interrupt</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA_7</name>
              <description>DMA Channel 7 Interrupt</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HSTICR</name>
          <description>Host Global Interrupt Clear Register</description>
          <addressOffset>0x0408</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DCONNIC</name>
              <description>Device Connection Interrupt Clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DDISCIC</name>
              <description>Device Disconnection Interrupt Clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSTIC</name>
              <description>USB Reset Sent Interrupt Clear</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSMEDIC</name>
              <description>Downstream Resume Sent Interrupt Clear</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXRSMIC</name>
              <description>Upstream Resume Received Interrupt Clear</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSOFIC</name>
              <description>Host Start of Frame Interrupt Clear</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HWUPIC</name>
              <description>Host Wake-Up Interrupt Clear</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
