hansfbaier/mecrisp-stellaris-atsame70/common/svd2forth-v3/ATSAME70N19.svd-cleaned.svd.uf.svd
        <register>
          <dim>10</dim>
          <dimIncrement>4</dimIncrement>
          <name>HSTPIPIMR[%s]</name>
          <description>Host Pipe Mask Register n = 0 0</description>
          <addressOffset>0x5C0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RXINE</name>
              <description>Received IN Data Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXOUTE</name>
              <description>Transmitted OUT Data Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXSTPE</name>
              <description>Transmitted SETUP Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PERRE</name>
              <description>Pipe Error Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NAKEDE</name>
              <description>NAKed Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVERFIE</name>
              <description>Overflow Interrupt Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXSTALLDE</name>
              <description>Received STALLed Interrupt Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SHORTPACKETIE</name>
              <description>Short Packet Interrupt Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NBUSYBKE</name>
              <description>Number of Busy Banks Interrupt Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FIFOCON</name>
              <description>FIFO Control</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PDISHDMA</name>
              <description>Pipe Interrupts Disable HDMA Request Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PFREEZE</name>
              <description>Pipe Freeze</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSTDT</name>
              <description>Reset Data Toggle</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>10</dim>
          <dimIncrement>4</dimIncrement>
          <name>HSTPIPIER[%s]</name>
          <description>Host Pipe Enable Register n = 0 0</description>
          <addressOffset>0x5F0</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>RXINES</name>
              <description>Received IN Data Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXOUTES</name>
              <description>Transmitted OUT Data Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXSTPES</name>
              <description>Transmitted SETUP Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PERRES</name>
              <description>Pipe Error Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NAKEDES</name>
              <description>NAKed Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVERFIES</name>
              <description>Overflow Interrupt Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXSTALLDES</name>
              <description>Received STALLed Interrupt Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SHORTPACKETIES</name>
              <description>Short Packet Interrupt Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NBUSYBKES</name>
              <description>Number of Busy Banks Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PDISHDMAS</name>
              <description>Pipe Interrupts Disable HDMA Request Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PFREEZES</name>
              <description>Pipe Freeze Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSTDTS</name>
              <description>Reset Data Toggle Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>10</dim>
          <dimIncrement>4</dimIncrement>
          <name>HSTPIPIDR[%s]</name>
          <description>Host Pipe Disable Register n = 0 0</description>
          <addressOffset>0x620</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>RXINEC</name>
              <description>Received IN Data Interrupt Disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXOUTEC</name>
              <description>Transmitted OUT Data Interrupt Disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXSTPEC</name>
              <description>Transmitted SETUP Interrupt Disable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PERREC</name>
              <description>Pipe Error Interrupt Disable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NAKEDEC</name>
              <description>NAKed Interrupt Disable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVERFIEC</name>
              <description>Overflow Interrupt Disable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXSTALLDEC</name>
              <description>Received STALLed Interrupt Disable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SHORTPACKETIEC</name>
              <description>Short Packet Interrupt Disable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NBUSYBKEC</name>
              <description>Number of Busy Banks Disable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FIFOCONC</name>
              <description>FIFO Control Disable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PDISHDMAC</name>
              <description>Pipe Interrupts Disable HDMA Request Disable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PFREEZEC</name>
              <description>Pipe Freeze Disable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>10</dim>
          <dimIncrement>4</dimIncrement>
          <name>HSTPIPINRQ[%s]</name>
          <description>Host Pipe IN Request Register n = 0 0</description>
          <addressOffset>0x650</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INRQ</name>
              <description>IN Request Number before Freeze</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>INMODE</name>
              <description>IN Request Mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>10</dim>
          <dimIncrement>4</dimIncrement>
          <name>HSTPIPERR[%s]</name>
          <description>Host Pipe Error Register n = 0 0</description>
          <addressOffset>0x680</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATATGL</name>
              <description>Data Toggle Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DATAPID</name>
              <description>Data PID Error</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PID</name>
              <description>Data PID Error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMEOUT</name>
              <description>Time-Out Error</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRC16</name>
              <description>CRC16 Error</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COUNTER</name>
              <description>Error Counter</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>7</dim>
          <dimIncrement>16</dimIncrement>
          <name>USBHS_HSTDMA[%s]</name>
          <description>Host DMA Channel Next Descriptor Address Register n = 1</description>
          <addressOffset>0x710</addressOffset>
          <register>
            <name>HSTDMANXTDSC</name>
            <description>Host DMA Channel Next Descriptor Address Register n = 1</description>
            <addressOffset>0x00</addressOffset>
            <size>32</size>
            <fields>
              <field>
                <name>NXT_DSC_ADD</name>
                <description>Next Descriptor Address</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>HSTDMAADDRESS</name>
            <description>Host DMA Channel Address Register n = 1</description>
            <addressOffset>0x04</addressOffset>
            <size>32</size>
            <fields>
              <field>
                <name>BUFF_ADD</name>
                <description>Buffer Address</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>HSTDMACONTROL</name>
            <description>Host DMA Channel Control Register n = 1</description>
            <addressOffset>0x08</addressOffset>
            <size>32</size>
            <fields>
              <field>
                <name>CHANN_ENB</name>
                <description>Channel Enable Command</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>LDNXT_DSC</name>
                <description>Load Next Channel Transfer Descriptor Enable Command</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>END_TR_EN</name>
                <description>End of Transfer Enable Control OUT transfers only</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>END_B_EN</name>
                <description>End of Buffer Enable Control</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>END_TR_IT</name>
                <description>End of Transfer Interrupt Enable</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>END_BUFFIT</name>
                <description>End of Buffer Interrupt Enable</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>DESC_LD_IT</name>
                <description>Descriptor Loaded Interrupt Enable</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>BURST_LCK</name>
                <description>Burst Lock Enable</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>BUFF_LENGTH</name>
                <description>Buffer Byte Length Write-only</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>HSTDMASTATUS</name>
            <description>Host DMA Channel Status Register n = 1</description>
            <addressOffset>0x0C</addressOffset>
            <size>32</size>
            <fields>
              <field>
                <name>CHANN_ENB</name>
                <description>Channel Enable Status</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>CHANN_ACT</name>
                <description>Channel Active Status</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>END_TR_ST</name>
                <description>End of Channel Transfer Status</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>END_BF_ST</name>
                <description>End of Channel Buffer Status</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>DESC_LDST</name>
                <description>Descriptor Loaded Status</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>BUFF_COUNT</name>
                <description>Buffer Byte Count</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>CTRL</name>
          <description>General Control Register</description>
          <addressOffset>0x0800</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RDERRE</name>
              <description>Remote Device Connection Error Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VBUSHWC</name>
              <description>VBUS Hardware Control</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FRZCLK</name>
              <description>Freeze USB Clock</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USBE</name>
              <description>USBHS Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UIMOD</name>
              <description>USBHS Mode</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>UIMODSelect</name>
                <enumeratedValue>
                  <name>HOST</name>
                  <description>The module is in USB Host mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEVICE</name>
                  <description>The module is in USB Device mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>General Status Register</description>
          <addressOffset>0x0804</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RDERRI</name>
              <description>Remote Device Connection Error Interrupt Host mode only</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPEED</name>
              <description>Speed Status Device mode only</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>SPEEDSelect</name>
                <enumeratedValue>
                  <name>FULL_SPEED</name>
                  <description>Full-Speed mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH_SPEED</name>
                  <description>High-Speed mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW_SPEED</name>
                  <description>Low-Speed mode</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKUSABLE</name>
              <description>UTMI Clock Usable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SCR</name>
          <description>General Status Clear Register</description>
          <addressOffset>0x0808</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>RDERRIC</name>
              <description>Remote Device Connection Error Interrupt Clear</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SFR</name>
          <description>General Status Set Register</description>
          <addressOffset>0x080C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>RDERRIS</name>
              <description>Remote Device Connection Error Interrupt Set</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VBUSRQS</name>
              <description>VBUS Request Set</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
