hansfbaier/mecrisp-stellaris-atsame70/common/svd2forth-v3/ATSAME70N19.svd-cleaned.svd.uf.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>NVIC</name>
      <description>Nested Vectored Interrupt Controller</description>
      <groupName>NVIC</groupName>
      <prependToName>NVIC_</prependToName>
      <baseAddress>0xE000E100</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xE04</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <dim>8</dim>
          <dimIncrement>4</dimIncrement>
          <name>ISER[%s]</name>
          <description>Interrupt Set Enable Register n</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SETENA</name>
              <description>Interrupt set enable bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>4</dimIncrement>
          <name>ICER[%s]</name>
          <description>Interrupt Clear Enable Register n</description>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CLRENA</name>
              <description>Interrupt clear-enable bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>4</dimIncrement>
          <name>ISPR[%s]</name>
          <description>Interrupt Set Pending Register n</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SETPEND</name>
              <description>Interrupt set-pending bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>4</dimIncrement>
          <name>ICPR[%s]</name>
          <description>Interrupt Clear Pending Register n</description>
          <addressOffset>0x00000180</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CLRPEND</name>
              <description>Interrupt clear-pending bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>4</dimIncrement>
          <name>IABR[%s]</name>
          <description>Interrupt Active bit Register n</description>
          <addressOffset>0x00000200</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ACTIVE</name>
              <description>Interrupt active flags</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>240</dim>
          <dimIncrement>1</dimIncrement>
          <name>IP[%s]</name>
          <description>Interrupt Priority Register 8Bit wide n</description>
          <addressOffset>0x00000300</addressOffset>
          <size>8</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PRI0</name>
              <description>Priority of interrupt 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STIR</name>
          <description>Software Trigger Interrupt Register</description>
          <addressOffset>0x00000e00</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>INTID</name>
              <description>Interrupt ID of the interrupt to trigger, in the range 0-239. For example, a value of 0x03 specifies interrupt IRQ3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>MPU</name>
      <description>Memory Protection Unit</description>
      <groupName>MPU</groupName>
      <prependToName>MPU_</prependToName>
      <baseAddress>0xE000ED90</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x2C</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>TYPE</name>
          <description>MPU Type Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <resetValue>0x00001000</resetValue>
          <fields>
            <field>
              <name>SEPARATE</name>
              <description>Indicates support for unified or separate instruction and date memory maps.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DREGION</name>
              <description>Indicates the number of supported MPU instruction regions.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>IREGION</name>
              <description>Indicates the number of supported MPU data regions.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <description>MPU Control Register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enables the MPU</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HFNMIENA</name>
              <description>Enables the operation of MPU during hard fault, NMI, and FAULTMASK handlers.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVDEFENA</name>
              <description>Enables privileged software access to the default memory map.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RNR</name>
          <description>MPU Region Number Register</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REGION</name>
              <description>Indicates the MPU region referenced by the MPU_RBAR and MPU_RASR registers.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RBAR</name>
          <description>MPU Region Base Address Register</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REGION</name>
              <description>MPU region field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>VALID</name>
              <description>MPU Region Number valid bit.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADDR</name>
              <description>Region base address field.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>27</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RASR</name>
          <description>MPU Region Attribute and Size Register</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Region enable bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SIZE</name>
              <description>Specifies the size of the MPU protection region.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SRD</name>
              <description>Subregion disable bits.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>B</name>
              <description>MPU access permission attributes.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C</name>
              <description>MPU access permission attributes.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>S</name>
              <description>Shareable bit.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TEX</name>
              <description>MPU access permission attributes.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>AP</name>
              <description>Access permission field.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>XN</name>
              <description>Instruction access disable bit.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RBAR_A1</name>
          <description>MPU Alias 1 Region Base Address Register</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>RASR_A1</name>
          <description>MPU Alias 1 Region Attribute and Size Register</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>RBAR_A2</name>
          <description>MPU Alias 2 Region Base Address Register</description>
          <addressOffset>0x0000001c</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>RASR_A2</name>
          <description>MPU Alias 2 Region Attribute and Size Register</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>RBAR_A3</name>
          <description>MPU Alias 3 Region Base Address Register</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>RASR_A3</name>
          <description>MPU Alias 3 Region Attribute and Size Register</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
        </register>
